[{"today":
{
  "text":"Other people may steal the spotlight from you today, Aries, but don't let it get you down. The key is to learn from the ones who take charge. Have fun and don't worry about the details. A definite dynamism is helping you transform certain areas of your life that need to change. Get out of the rut you're in.",
  "matches":[11,5,6],
  "ratings":[4,2,4,3],
  "money":[]},

  "yesterday":
  {
    "text":"  This is your day, Aries, so don't let anyone take it away from you. The key will be to get a head start on whatever goals you wish to accomplish. Don't waste time thinking about exactly how you're going to accomplish them. Just get started. The first step is the most important. You're grounded right now, helping you get a better handle on what it is you need to do.",
    "matches":[9,3,6],
    "ratings":[3,3,2,2],
    "money":[]},

  "tomorrow":
  {
    "text":" If an emotional issue is bringing you down, Aries, find healthy ways to relieve the situation. Overeating won't solve the problem. This will only mask your difficulties and make them harder to deal with later. It's time to pull out of the rut and infuse the situation with freshness. You have a great deal of love to share with the world.",
    "matches":[10,5,6],
    "ratings":[4,4,4,3],
    "money":[]},

  "week":
  {
    "text":"    Don’t ignore your long-term goals for short-term pleasure, Aries! On Tuesday, Venus in Leo opposes Saturn in Aquarius, making you too focused on pleasure and your romantic relationship and isolating you from your other dreams and even your friends. Find balance to stay afloat.Stay in and nurture your inner child on Friday when the new moon is in sensitive Cancer. The new moon is in your home and family zone, encouraging you to stay close to home to find peace. Practice self-care and, above all, avoid family drama if you can help it.Home continues to be where your mind is when Mercury enters the Crab on Sunday. The next two weeks truly become a family affair as your thoughts turn more to domestic matters and searching for emotional security. Be careful with what you say because your words will have emotional impact. ",
    "love":"    The compassionate vibe from the Cancer sun gives you all the feels at the start of the week. You don’t like to show your emotions often, but now you don’t think of being emotionally vulnerable as a weakness. What’s stopping you from saying the L word, Aries?The sun-Uranus sextile around the same time gives you reason to believe that a romantic situation will change soon. Don’t believe everything you hear, though. Wait for confirmation before you do something you might regret later.The new moon at the end of the week is also in sensitive Cancer, helping you come to an understanding with an ex about why things ended the way they did. You’ll be feeling sentimental now, but resist the urge to go backward. ",
    "career":"    It will be easy to find people who think like you now. Casual conversations can help both parties be more effective and make the time fly. Movie theaters, businesses that sell liquor, and anything that gives compassionate service to others can expect a busy, profitable week. This is still a period when you can expect some delays. The time supports legal matters and doing important research in order to make your work more effective.",
    "wellness":"    Too much of anything can be detrimental to your system, including fun, which is why it helps to spend time alone. You're in the mood to live life to the fullest, but try and keep a semblance of balance. If your energy reserves get depleted or immune system runs down, you could be more vulnerable to infection. Inner peace is the key to good health.",
    "money":"    This week the Universe affects your house of money. It's time to reevaluate how you currently earn money. Do you hate your job? Would you like to find more meaningful work? This week gives you the opportunity to discover a new way to make your dream job a reality.",
    "matches":[11,5,6],
    "ratings":[4,2,4,3]},

  "month":
  {
    "text":" Dig deep and evaluate your emotional security, Aries. The sun and Mercury can help you to tap into your intuition and practice more self-awareness. While you could feel a bit more emotional if you haven’t been feeling the most stable as of late, the planetary energy should help you be proactive about how to improve this and integrate more self-love.The new moon in your solar fourth house appears on   9, opening a doorway to make improvements in your domestic sphere. Some Aries could decide it’s time to move or fix up their space. If a parent or family member needs help at this time, step up to aid how you can.Fiery Mars, your ruler, remains ignited within your solar fifth house of passion throughout most of the month, meaning you’re in the mood to have some fun and be romantic. This is the best period in two years for single Aries to put themselves out there to find someone new. Creative and fertility concerns are also favored.The full moon in your solar eleventh house of friendship appears on the twenty-third and may bring a culmination, turning point, or ending regarding your social life. Bad news regarding an acquaintance could come your way near this time. Hopefully, though, you’ll be able to sidestep the problem through your resourcefulness and lighthearted attitude.To end the month, on   28, benevolent Jupiter sweeps into your social sector like an angel, raining showers of happiness and prosperity down upon you for the rest of the year.Standout days: 13, 22, 24Challenging days: 1, 9, 17",
    "matches":[11,5,6],
    "ratings":[4,2,4,3],
    "money":[]},

  "year":
  {
    "text":"\nThere is a great deal to be learned through the other side of the story these days, Aries. 2020 brought out your more practical and protective side. You were forced to dive so deeply inward, and now you know what you are able to take, and what you can no longer tolerate in your life.\n\nAs you pummel into 2021 with your naturally inquisitive nature, there can be an honest review of where you want to direct the show. This means that you must take authority back in some capacity throughout the year.\n\nSaturn's influence in Aquarius sextiles your sign nicely, giving you a boost of confidence in your career pursuits. This energy can even help you heal some issues around respect and open your mind to new and different methods of leadership. This holds true for you even when a square formed between Saturn in the Water-bearing sign and Uranus in your neighboring sign of Taurus on February 17, June 14, and December 24. There's a direct emphasis on your self-worth during these months as you become more aware of what is best for the greater good.\n\nYou might feel torn at times if you are striving hard and finding strength by following your own direction. If you keep your eye on the prize, you will not leave anyone behind. In fact, you are carving a lesser-known path to lead the way for an entire community. This year, certain lunar eclipses vacillate between Sagittarius and Gemini, activating your personal zones of higher learning and spiritual development, and requiring you to find the words for what you are feeling.\n\nIn 2021, you might have many moments of precognition or feel more in alignment with your intuition, especially surrounding the Sagittarian eclipses, being a May 26 total lunar eclipse and a total solar eclipse on December 4.\n",
    "matches":[],
    "ratings":[],
    "money":[],
    "love":[],
    "career":[],
    "wellness":[]}},

  {"today":
  {
    "text":" It may seem like close loved ones are trying to pick a fight with you today, Taurus. There may tend to be a \"me first\" attitude stirring up a pot of trouble. Don't automatically assume that the other person is wrong. There's a valuable lesson to be learned in every conflict. Take each disagreement as an opportunity to learn something about yourself.",
    "matches":[11,6,7],
    "ratings":[4,4,4,3],
    "money":[]},

    "yesterday":
    {
      "text":"  Open up and reveal more of your sensitive side, Taurus. The more willing you are to share with others, the more they will feel comfortable sharing things with you. Your head and heart are in agreement, so use this to your advantage. Ground your mind and use it to take a rational approach to your feelings. The truth of the situation will become clear.",
    "matches":[12,6,7],
    "ratings":[4,2,4,3],
    "money":[]},

    "tomorrow":
    {
      "text":" Whatever you visualize today will likely materialize in the near future, Taurus. People are clamoring to make themselves heard, so jump in with your opinion. Keeping things balanced in your world means getting your needs met as well. Don't sacrifice your well-being just to maintain the peace. Make changes that benefit all parties involved.",
      "matches":[11,6,8],
      "ratings":[4,2,3,3],
      "money":[]},

    "week":
    {
      "text":"    Your week includes some serious family drama when Venus in Leo squares Uranus in your sign on Thursday. You have the urge to be free and independent, but your family tries to control both you and your financial situation. Overall, it’s a frustrating day.Fortunately, the week gets better when the new moon is in Cancer and your communication zone on Friday. This is an excellent day to speak your mind and discuss your feelings to find peace and clarity. Take a short trip, but don’t stray too far from home.Continue to express yourself when Mercury enters Cancer on Sunday. It will be much easier to express your thoughts and feelings clearly and logically for the next two weeks, so use it to your advantage. Your thoughts will be more creative as you express yourself in unique ways. Expand your emotional intelligence and be open to learning new things! ",
      "love":"    With the sun in emotional water sign Cancer as it sextiles logical Uranus in your steady sign at the beginning of the week, you get a healthy dose of balance in your love life. When changes throw you for a loop, as they inevitably will now, you’re able to keep yourself from overreacting.Your ruling planet lovely Venus is traveling in fiery Leo during her square to Uranus midweek, creating a bit more tension in your love sector. This time, changes can create difficulties no matter how you react to them. Be patient.Messenger Mercury joins the sun in Cancer over the weekend, making sure that you ask people about their wants and needs while practically ignoring your own. Your shyness could inhibit someone’s ability to get to know you as much as they’d like.",
      "career":"    Your imagination could run wild now. Do your best to balance fantasy with reality. This is also true when working with co-workers. Don't make assumptions. A thoughtless word could spark a controversy. This period is excellent for making contacts and selling anything that supports beauty or greater harmony. Staff meetings will be interesting and productive. Organize your workspace now. Travel or research to upgrade your skills is favored.",
      "wellness":"    Continue with your current routine. This period may be tense, so give yourself space to do everything. Your partner's health could be delicate, so a little TLC wouldn't hurt. It's nothing serious. Fresh air will help you both feel better. Drink plenty of fluids.",
      "money":"    This week is about the celestial configurations creating a lot of tension for you. It begins in your house of personal expression and self-worth, indicating a need to address the way you project yourself into the world. You can be anyone you want to be now.",
      "matches":[11,6,7],
      "ratings":[4,4,4,3]},

    "month":
    {
      "text":" Let your voice be heard, Taurus. With the sun and Mercury moving through your solar third house of communication through most of  , you have a deeply important message that you’re ready to tell the world.The new moon on   9 falls in this sector and could help you take the next steps in a writing, speaking, advertising, or social media endeavor. Fine-tune your approach and know the stars are in your favor to persuade the audience you’d like to reach. This same lunation could bring a new contract your way as well.Next to note is that mighty Mars continues to heat up your solar fourth house of domesticity all month, and this likely sees you especially busy with a move or renovation. You could also be very focused on stepping in to aid a family member in need.The full moon this month arrives on the twenty-third, the first of two back-to-back major lunations to highlight your solar tenth house of achievements. While this full moon could lift you into the spotlight, bring news of a promotion, or see that you’re quite busy with work, it appears there could be some hiccups or obstacles at this same time.Keep persevering, because benevolent Jupiter swoops in to aid you starting on   28 and for the rest of the year. It’s clear that, even if the burden is heavy, you’re stepping up higher than ever before. You have what it takes to succeed, Taurus.Standout days: 5, 13, 20Challenging days: 3, 8, 17",
      "matches":[11,6,7],
      "ratings":[4,4,4,3],
      "money":[]},

    "year":{"text":"\nWelcome to a brand-new year ahead of you, Taurus! There's a ton of unpacking you have yet to do, and yet you do not even know where to fully begin. You've been experiencing the lessons of having the planet of chaos charging through your sign with both glimpses in 2018 and moving full-on in 2019. However, this year adds a bit of strife to this energy.\n\nUranus does not like constraints under any circumstances, and as Saturn opens the year strongly situated in fellow fixed sign Aquarius, you could find yourself in a continual crossroads. In fact, this is the overall energy of your year. Feeling like you are moving forward and being yanked into place having to wait for changes to take their full effect. You might see through things so much that at times, it might even anger you. This year requires a great deal of maturity and patience on your part. Yes, there can feel like great losses, mainly not through your own undoing, but through the continual clash between Saturn in the Water-bearing Aquarius and outer-body Uranus in your sign.\n\nThe year's lunar cycles are eye-opening in your personal zones of self-acceptance and spiritual growth. The May 26 total lunar eclipse in Sagittarius does shed light on those areas of your life that you've tried to sweep under the rug. Understand that eclipses are galvanizing energy that truly wants you to get real with yourself so that you may heal from this situation. The annual solar eclipse in Gemini on June 10 can add some clarity to your overall financial destiny—also reflected with a partial lunar eclipse in your sign of the Bull on November 19. Then luckily, you'll feel the weight off your shoulders on December 4 as the total solar eclipse sees you revisiting certain events and scenarios around your karmic connections, this time with a renewed sense of self.\n","matches":[],"ratings":[],"money":[],"love":[],"career":[],"wellness":[]}},{"today":{"text":" A close loved one may express displeasure with the way things are, Gemini. Maybe there's some tension in the air. Things could get rather explosive. There's a feeling urging others to act, a certain restlessness that demands that you take action. Unfortunately, this action is likely to meet with opposition if you aren't careful.","matches":[12,7,9],"ratings":[4,2,3,3],"money":[]},"yesterday":{"text":"  Things should go well for you today as long as you can keep the drama to a minimum. You can jump over any hurdle in your way, so don't worry about a thing. You have a sharp, intuitive wit about you that's grounded in the real world. Take care of the details and plan your next big move. Clean, organize, and throw away things that no longer serve you.","matches":[12,7,8],"ratings":[4,4,4,3],"money":[]},"tomorrow":{"text":" Inflated egos might block your progress today, Gemini, so be on the lookout for people trying to get a bigger slice of the pie than they deserve. Be realistic in terms of how you allocate resources to people around you. Someone may be trying to take advantage of your generous spirit. Use your detective skills to get to the root of the problem and make any necessary changes.","matches":[11,5,10],"ratings":[2,3,2,3],"money":[]},"week":{"text":"    Yikes, Gemini! Your week begins on a bit of a rough note when Mercury in your sign squares Neptune in Pisces on Tuesday. An impulsive decision or miscommunication could lead to disaster at your job. Ask for clarity before jumping into a situation or it could cost you dearly.Then it’s all about self-care when the new moon is in gentle Cancer on Friday. The new lunar cycle begins in your value zone, encouraging you to find new ways to invest in yourself and boost your self-esteem without egotism.As Mercury leaves your sign and moves into gentle Cancer on Sunday, it’s a good time to start thinking about how you spend and save your money. Consider how you can wisely make your money grow and how you invest in your future. Be careful with your words for the next two weeks; they hold greater value.","love":"    With your outgoing sign hosting your ruler Mercury during its square to dreamy Neptune in Pisces, you’re not shy about expressing your fantasies. Talking about sexy details is a turn-on, but you could encounter problems with dishonesty.The new moon in imaginative Cancer at the end of the week puts you in the mood for romantic seduction, and your mind conjures up all kinds of deliciously sexy scenarios. Are you bold enough to move ahead with your plan?Chatty Mercury leaves your sign over the weekend to partner with the Crab, which gives out moody, sensitive vibes. If you’re talking to someone for the first time, they might get the mistaken impression that you’re shy, which couldn’t be further from the truth!","career":"    Expect to have excellent relationships with both customers and co-workers now. If you're looking for something new, these days are great for networking and building work teams. Casual conversations can lead to something positive. Tolerate with good humor any roadblocks you encounter. It's best not to take seriously the reactions of stubborn people. Cooperation is better than outright opposition. You could do your best written work now.","wellness":"    The cosmos could cause some tension. You may be trying to muster the willpower to get moving. There seem to be annoying symptoms or even minor accidents that prevent you from feeling 100 percent. This could be because you're frustrated with some area of your life. Get it figured out and help yourself feel better. Exercise away the cobwebs.","money":"    You may have to do some bobbing and weaving with all the astrological aspects out there this week! The Universe can bring a lot of news and offers, which is great, but they'll be short-lived, so be poised and ready to take action. If you happen to receive any bad news, make sure to take a break to recuperate.","matches":[12,7,9],"ratings":[4,2,3,3]},"month":{"text":" You have a sharper mind and more clarity for the first time in weeks with your ruler Mercury returning to normal speed this month, Gemini. It remains in your zodiac sign until   11, helping you articulate what was amiss before.Also, with fiery Mars igniting your solar third house of communication all month, you’re ready to declare the most important messages within your soul to the world. Use the energy to persuade the audiences before you that your ideas are the ones with promise. You could also be especially focused on launching a writing, speaking, advertising, or social media initiative at this time.A full moon in your solar ninth house of expansion also appears this month on the twenty-third. This is the first in two back-to-back full moons and could bring a culmination to an academic, media, immigration, or traveling initiative. No matter how, seek to integrate more ideas and wisdom into your inner world. Some Geminis might decide it’s time to return to school, while others may see the arrival of their first published work. With your mind so active, you could find yourself especially inspired.To end the month, benevolent Jupiter, who has sat perched at the top of your chart bringing professional success in recent weeks, once again dips his toes back into this same solar ninth house beginning on   28. Use the time before this to evaluate your professional goals and how you can soar even higher.Standout days: 12, 24, 29Challenging days: 6, 23, 25","matches":[12,7,9],"ratings":[4,2,3,3],"money":[]},"year":{"text":"\nThere’s for sure plenty to talk about this year, Gemini! 2021 is a highly stimulating year for your creative sign. You are able to feel more aligned with your highest good, and can even make some pretty fantastic new friends along the way. You might actually be the go-to person when things get a little rocky, mainly because you adjust so easily and quickly to things and are able to see the humor in almost any situation.\n\nAs the year begins with some confrontational squares between Jupiter in Aquarius and Uranus in Taurus, you'll get a beneficial wave of abundance headed your way even through some gritty energy. This is also true in mid-February, May, and late December for you as Saturn's transit through Aquarius squares Uranus in Taurus, causing some chaotic waves in the world.\n\nThis can be tough on others through much of the year; but because Saturn will be nicely angled towards your airy sign, it will be bringing you many insights and brilliant moments. This can be that time where you find yourself in a very powerful way. Expect the unexpected and be extremely grateful for the gifts you receive, because you deserve them!\n\nOne important piece of the 2021 puzzle is to really consider the transition period of your birthday months. You might be a little caught up during this year's Mercury retrograde cycles, which all take place in air signs. One of the most important for you occurs on May 29, following a transformative total lunar eclipse in your opposing sign of Sagittarius. This is a vibe that will definitely have you rethinking a lot of different pieces of the story. And although it can be a highly enlightening time when it comes to all aspects of your life, there is still much work to be done through the summer. Especially because you are also met with an annular solar eclipse on June 10—at the same time Mercury continues a tricky retrograde cycle in your sign until June 22.\n","matches":[],"ratings":[],"money":[],"love":[],"career":[],"wellness":[]}},{"today":{"text":" Fire up today, Cancer, and let your spirit fly. You have a great deal of ammunition that encouraging you to take charge. Let your adventuresome spirit roam wherever it pleases. Communication with loved ones will be clear. You can expect all social encounters to go smoothly. You will be the hit of any party.","matches":[12,6,11],"ratings":[2,3,2,3],"money":[]},"yesterday":{"text":"  You may have to bring yourself down to ground level in a rather sobering fashion, Cancer. Maybe you're forgetting an important piece of a goal that you've been shooting for. This is a good day to review your progress and deal with any details that require attention. Keep your adventurous spirit alive, but have at least one foot on solid ground.","matches":[1,8,10],"ratings":[4,2,3,3],"money":[]},"tomorrow":{"text":" This day will be agreeable, Cancer. There is a dynamic energy in the air that's fueling your fire. Have a good time regardless of what you do. An adventurous, high-spirited approach will get you where you need to go in every situation. You have the power to make important transformations that will help you in the future.","matches":[12,6,9],"ratings":[3,3,4,2],"money":[]},"week":{"text":"    With so many planets in your sign, Cancer, this is your week to shine. We start things off with the sun in Cancer sextile Uranus in Taurus on Monday. This is an ideal day to get involved in humanitarian causes and help those in need. Sudden changes could lead to positive things, so don’t get overwhelmed by the shuffle.Friday brings new beginnings during the new moon in your sign. While this isn’t an ideal time to make huge life changes, the start of a new lunar cycle can bring positive adjustments as long as you keep an optimistic point of view. Take care of your body and rest.You keep shining when Mercury enters Cancer on Sunday. With the planet of communication in your sign, use that energy to speak up for yourself. Don’t let others walk all over you—get what you want. Be polite but direct!","love":"    As the sun spends time in your watery sign at the start of the week, it sextiles offbeat Uranus traveling in steady Taurus. While this isn’t the most stable energy in which to begin a relationship, it does keep things interesting. Don’t make snap judgments now.The moon, your guiding body, is in your sign when it enters its new phase at the end of the week, inviting you to seek out the comfort and security that you crave. One-night stands aren’t your thing now because you’re looking for your soul mate, not just someone who’s good in bed.Communicative Mercury partners with your sensitive sign over the weekend, making it more difficult for you to express your true emotions. Clamming up in front of your crush can be embarrassing, but you don’t have to make it more awkward than it is. You’ll get another chance.","career":"    Finish all you can now. These days are the best for concentrated work that you may have to do alone. Things begin to loosen up as the time progresses. This period can bring unexpected surprises. Avoid creating extra drama in an uncertain situation. This is a good time to upgrade tools and technology. The work will energize you. It will be easier to feel more positive. Expect progress when working with people from another culture.","wellness":"    You seem to be living on the edge, especially as far as your social life is concerned. You could get frazzled by staying out late, drinking too much, and exposing yourself to smoke. If you have to be on the go, take care of yourself the rest of the time. Walk in the fresh air, get adequate sleep, and eat nourishing food.","money":"    With so many planets affecting your money house this week, you may be tempted to run and hide. But as the Universe focuses on your house of money and values, you're being asked to be more responsible for how you earn money. You're also being urged to be a lot more outgoing when it comes to your money.","matches":[12,6,11],"ratings":[2,3,2,3]},"month":{"text":" With the mighty sun in your zodiac sign at the onset of  , it is your birthday season, Cancer! Now is the time to stand in your power and show the world that you’re a star in your own right. Your solar return is the most important time of the year to set goals, create intentions, and take actions to make new patterns for the year ahead.The loveliest new moon of the year arrives on   9. It falls within your zodiac sign and spotlights your personal hopes, so use this time to put yourself first. Mercury, planet of communication, is in your sign from the eleventh to the twenty-seventh, making you especially persuasive and eloquent.Feisty Mars continues to power through your financial sector all month, increasing your focus on money matters. While this could cause your expenses to skyrocket, it can also give you a strong impetus to budget and work toward more prosperity.Next to note this month is the arrival of the full moon in your solar eighth house on   23. This is the first of two back-to-back full moons in Aquarius, and a turning point has arrived. Your intimate needs and the balance in your relationships will be discussed.This could also bring news about a large sum of money, perhaps in the form of a debt, loan, scholarship, venture capital, royalty check, or settlement. However, with the planets clashing with this full moon, there could be some disappointing news around this area too.Standout days: 5, 9, 15Challenging days: 3, 12, 17","matches":[12,6,11],"ratings":[2,3,2,3],"money":[]},"year":{"text":"\nYou are here for a major reason, and 2021 is one of those years where you've got to surrender to the outcome. You made some incredible changes during 2020 and are making some real headway. There were many ups and downs that could have felt a little more traumatic than normal, especially for your compassionate sign of the Crab.\n\nThis year really serves as looking at your life from an outsider's perspective. You're able to take an observer’s perspective and might even consider diving into some deep self-reflection that you once shied away from. Working in several facets of spirituality, body care, research, and expanding your mind, in general, is what 2021 is all about. There is nothing too out-of-the-ordinary for you right now, as you might even be more interested in either paranormal or occult-type studies.\n\nYou are extremely tied to the cycles of the moon, who's nodes now cycle between Gemini in the north position and Sagittarius in the south position. You are working out karmic cycles through learning your own patterns in communication and understanding what stories you've been told for far too long. You might even be faced with the truth about a family situation that you once spent far too much time trying to resolve. Maybe you've sacrificed your own happiness for the good of your loved ones only to come to terms with what you really want for yourself.\n\nThis is a year where you can really step into your own independence and gain a little emotional space from the judgments of others. There's a refreshing tone to your life once you accept the truth about something you've been stuffing under the rug. 2021, in general, is a time for you to face the music, and see how special you really are! Stop being so hard on yourself, loving Cancer!\n","matches":[],"ratings":[],"money":[],"love":[],"career":[],"wellness":[]}},{"today":{"text":" Put your reservations aside, Leo, and go for the thing your heart desires most. Throw caution to the wind and make it happen. Today's energy urges you to take charge of your life and conquer new territory. There's dynamism about the day that could leave you behind unless you latch onto the trend and make it work for you.","matches":[1,7,10],"ratings":[3,3,4,2],"money":[]},"yesterday":{"text":"  You have a tremendous ability to understand the inner workings of any situation, Leo. You may need to give someone a reality check to make sure they're on the same page as you. Use your criticism constructively so you don't alienate yourself from the people. Help to fill in the blanks in a situation that isn't fully understood by all parties, and move the project to the next level.","matches":[1,7,12],"ratings":[2,3,2,3],"money":[]},"tomorrow":{"text":" Don't be quick to criticize today, Leo. Keep things positive and think about how you can compliment someone. Your heart might need a bit more attention than usual, so surround yourself with people who bring your spirits up rather than drag them down. If you're always looking to the future, you may not realize all the wonderful things happening in the present.","matches":[3,7,12],"ratings":[2,4,4,4],"money":[]},"week":{"text":"    Your week begins with relationship drama when Venus in your sign opposes Saturn in Aquarius on Tuesday. If you just want a new relationship, slow down! You might be moving too quickly and making the other person uncomfortable. Relationships mean respecting boundaries, Leo so be chill.Instead of showering your beloved with affection, spend Friday night alone when the new moon is in Cancer. This is an ideal day for privacy as you work on any personal issues you may be dealing with.After a long period of Mercury in Gemini, you could feel the urge to take a social (and social media) break starting when Mercury moves into Cancer and your privacy zone on Sunday. Stop posting about your personal life and keep a low profile for the next two weeks. No one needs to know your business. Dealing with personal issues publicly could blow up in your face.","love":"    With your ruler sun in soul mate-seeking Cancer this whole week, you’re willing to trade some drama for true love. You still thrive on excitement, but there has to be something more for you to be truly interested in someone.With financially focused Venus in your fiery sign as she squares Uranus in money-savvy Taurus midweek, you might look at romantic possibilities from the perspective of what they can do for your bank account. It isn’t necessarily wrong to combine the two, but keep the term â\u0080\u009cgold diggerâ\u0080\u009d in mind as you proceed.Communication manager Mercury partners with quiet Cancer over the weekend, which waters down your discussions just a bit. You want to talk about more serious things and are a lot less silly. This mood change might surprise someone you’ve only chatted with online.","career":"    This is a time when your desire to be of service can have you moving in several directions at once. Be sure you aren't doing too much out of a misplaced sense of guilt. This is a powerful time to make a difference for anyone in a service-oriented or humanitarian career. Those with a more imaginative nature may have trouble staying organized. Avoid blaming yourself for disappointing outcomes. Simply keep doing your best.","wellness":"    You might have to deal with headaches now. You may need to express your anger but find yourself blocked. This and being under pressure may cause your body to react. You need to be especially careful now. Later these problems should ease and you'll feel ready for anything. Don't give up your health and exercise program.","money":"    This week your career sector is affected. The Universe is pushing you to make some decisions you've been putting off for some time. If you've wanted to change careers or do some additional research, it's time to get cracking. This aspect has a way of kicking your butt to do the right thing.","matches":[1,7,10],"ratings":[3,3,4,2]},"month":{"text":" Take the lead, Leo. Powerhouse Mars continues to ignite your zodiac sign until   29. During this time, your energy level should be at an all-time high as you radiate magnetism, sex appeal, and dominance. Use this to fuel all of your personal and professional goals. Nothing can stop you if you fight toward it now!This can also give you the strength you need to set the patterns you’d like to follow for the coming two years. Mars only visits your zodiac sign once during that time, so make sure to work hard to launch things now.However, with a new moon in your solar twelfth house arriving on the ninth, you’re likely lying low, resting, and brainstorming. This is a great moment to be strategic about putting all the necessary pieces in place to make your greatest impact.As soon as the sun soars into your zodiac sign on   22, you’ll light up like fireworks with your birthday season here. Roar and show the world what you’ve got!A full moon in your solar seventh house of relationships arrives on the twenty-third. This is the first of two back-to-back full moons in Aquarius, showing a major turning point in your partnerships. While this lunation could bring you closer in the form of moving in together, an engagement, or marriage, there is also the possibility of a separation if you aren’t in alignment. Know what you want and what you’re worth rather than settle for less.Standout days: 13, 22, 29Challenging days: 1, 3, 6","matches":[1,7,10],"ratings":[3,3,4,2],"money":[]},"year":{"text":"\nThis is a huge year for your exuberant sign, Leo! There is so much going on, that it is often hard to keep track of all the wonderful goodies in store for your sign of the Lion! A major component of this year is also learning how to let go and surrender to the unknown.\n\nThe theme for your fire sign is to have the patience to know that it will all end up exactly the way it is supposed to be! Along these lines, you are met with incredible tests of faith throughout 2021 that will leave you flabbergasted at how awesome it is to be yourself! There will be some emotional tests and energetic changes, but with your commanding presence, you'll be able to handle it all with ease.\n\nThe year begins with a strong mid-January square between Jupiter in your opposing sign of Aquarius and Uranus in fellow fixed sign Taurus, creating a challenging T-square energy in your chart. This isn't the easiest of configurations to deal with at all, requiring extreme self-care in many circumstances.\n\nThis T-square affects all realms of your life, and is also brought around again with the Saturn in Aquarius square to Uranus in Taurus, spanning a cosmic influence through mid-February, mid-June, and late December. These will be time periods where you'll face a ton of internal and external friction, and in many cases, can be a certain straw that breaks the camel’s back with respect to your career, relationships, and public life.\n\nFinally, this year’s lunar eclipses will also trigger some important cycles highlighting your personal zones of self-expression, professional relationships, and community development in May, June, November, and December.\n","matches":[],"ratings":[],"money":[],"love":[],"career":[],"wellness":[]}},{"today":{"text":" There may be tremendous changes in store for you, Virgo. Connect with something futuristic and far out. There may be some roadblocks in the way. Maybe your heart is impeding your progress. You don't need another person to fill in any voids in your life. Your confidence is what you need to bolster your self-esteem.","matches":[4,8,1],"ratings":[2,4,4,4],"money":[]},"yesterday":{"text":"  Don't say anything about someone behind his or her back that you wouldn't want to say if the person were standing right next to you, Virgo. Feelings are easily hurt on a day like this. People will instinctively know that you've been saying negative things about them. Come clean with any confessions that you might need to make toward someone you love. Be honest and open with your feelings.","matches":[2,8,11],"ratings":[3,3,4,2],"money":[]},"tomorrow":{"text":" Things might reach a climax in some way today, Virgo. Set aside time to think about what you can do to love yourself. Maybe you've been thinking so much about group needs that you've failed to think about how to take care of yourself. Preaching your ideas and values to others means nothing unless you apply them to yourself.","matches":[3,9,12],"ratings":[3,4,3,2],"money":[]},"week":{"text":"    Miscommunication could lead to trouble in your relationships when Mercury in Gemini squares Neptune in Pisces on Tuesday. Giving so much of your time and attention to your career ambitions could lead you to neglect your important personal relationships. Be present when you’re with others, Virgo.The week gets better when the new moon is in Cancer on Friday. This is an ideal day to lend a hand and give back to your community. Doing some charity work or organizing a fundraiser for a worthy cause is a great way to use the positive energies from the new moon.Sunday brings out your inner social butterfly when Mercury enters Cancer. Put yourself out there and meet some new people. They could become your best friends after some time. The next two weeks are ideal for saying positive mantras and manifesting. Your words can make your dreams come true. ","love":"    The sun is partnered with water sign Cancer this week, giving you an optimistic feeling about finding your soul mate. Have you considered all your options? They might be closer to home than you think.There’s a midweek square between Venus in enthusiastic Leo and Uranus in kindred earth sign Taurus that can bring about major changes to your financial status, which in turn can affect your love life. Don’t cancel a date just because you can’t afford it. There are lots of fun things you can do for free.When your ruler Mercury exits talkative Gemini for reclusive Cancer over the weekend, people will have to try a lot harder to get you to come out of your shell. However, whoever succeeds in doing so has excellent long-term potential. Sometimes you just need the right person to say the right thing for you to open up and bare your soul.","career":"    New ways of doing things may be pressing you from several directions now. The idea that you must make or can't avoid making a change can come as quite a shock. Slow down when uncertain. Making a work friendship into something more could bring complications you haven't considered. Family responsibilities could demand compromises at work. Do your best with any limitations you face. Careful work now helps build for the future.","wellness":"    Your energy level is high, but a number of influences may cause you to overeat and indulge as a way to try to feel better. One issue could be causing you frustration, and this won't help you function at your best. Try to be good to yourself.","money":"    This week is all about your relationships. Your personal life and your professional contacts will become very important now. Pay for a dinner or two if you have to. Getting together with powerful friends has a way of paying off in the end.","matches":[4,8,1],"ratings":[2,4,4,4]},"month":{"text":"   could be a sweet month for you, Virgo. While Mars continues to ignite your solar twelfth house for most of the month, you could be quite busy behind the scenes or working in solitude. This is a great period to be strategic as you plan ahead so that when the planets start to migrate into your zodiac sign, you can show the world what you’ve got!Venus showers you in radiance and pleasure from   21 on, while the red planet ignites you beginning on the twenty-ninth. Focus on putting yourself first and enjoying more fun, recreation, and intimacy. The sun further enhances this as it moves through your solar eleventh house of friendship at the onset of the month.The new moon dawns in this same zone on   9, opening a doorway for you to interact more with your network and community. You may hear of exciting news from an acquaintance or even attend a lovely event. Someone might even step in at this time to provide an introduction that allows you to move toward one of your greatest hopes and dreams.A full moon in your solar sixth house rises in the night of the twenty-third, the first of two back-to-back full moons in Aquarius, showing a shift in your employment or physical health. Some Virgos could start or end a job, but either way you’ll be especially busy. Assess your diet and exercise regimen, because you might need to change something if it isn’t working for you. On   28, benevolent Jupiter returns to this same sphere to act as your guardian angel.Standout days: 9, 15, 24Challenging days: 6, 17, 23","matches":[4,8,1],"ratings":[2,4,4,4],"money":[]},"year":{"text":"\nThis is a major career year for your sign, Virgo. Your analytical self will enjoy the hard work and dedication it takes to make your dreams become a reality, but you also get a little boost of love from the cosmic cycles as well. You've done a lot of good deeds for so many people that it's kind of your time to let some good be returned to you as well. The only problem is sitting still and letting yourself have some fun along the way!\n\nA major aspect this year is your tenth house and fourth house being influenced by the current nodal transits as well as the lunar eclipses. The moon’s north node of fate transits through Gemini and sits high in your zone of career development, asking you to enjoy life a little more even as you are often obsessed with staying in control. The south node in Sagittarius asks you to let go of what no longer serves your soul and wants you to let go of any false narratives that have held you back.\n\nMore specifically, your energy is tied to the May 26 total lunar eclipse, the June 10 annular solar eclipse, the November 19 partial lunar eclipse, and the December 4 total solar eclipse. These dates can help you set a schedule and look at the actual patterns unfolding in your life at these specific times. You're going to be challenged to the max, but you will find your way through your own destined path. Your earthy sign is being given a lot of chances to prove yourself this year, as you are meant to fully thrive in all realms of life, love, and business.\n","matches":[],"ratings":[],"money":[],"love":[],"career":[],"wellness":[]}},{"today":{"text":" Be bold and aggressive today, Libra. Even if this isn't in your nature, dynamic action can be rewarding on a day like this. People will be delighted to hear from you. Your opinion is precious. You have many insights to offer the group. Your adaptable nature will be tested. You may need to make adjustments in order to match other people's way of thinking.","matches":[4,10,1],"ratings":[3,4,3,2],"money":[]},"yesterday":{"text":"  When it comes to decisions, Libra, do what's best for you today. Don't feel like you need to perform certain tasks just because of guilt over a past situation. Do things because you want to, not because you feel obligated to someone else. The only obligation you have is to you. If it's truly your desire to help someone out, then go for it, but don't sacrifice too much of yourself in the process.","matches":[5,9,2],"ratings":[2,4,4,4],"money":[]},"tomorrow":{"text":" Don't wait for someone else to take the lead today, Libra. Take charge. Do what you know is right even though someone else might disagree with you. You know what's best for you and the situation at hand. Be just as strong and bold as anyone else. You have every right to state your opinion. Act on the things you believe in.","matches":[5,11,2],"ratings":[2,4,2,2],"money":[]},"week":{"text":"    Your week begins with a struggle between the status quo and self-expression when Venus in Leo opposes Saturn in Aquarius on Tuesday. You want to do what everyone else is doing, but you also need to discover your own pleasure. Find friends who encourage you to have fun and express yourself, not put labels on you.The new moon in Cancer brings goals and ambitions to the forefront on Friday. This is a great day to jump-start some career goals you’ve had in mind. However, remember to take baby steps. Rome wasn’t built in a day, and your plan for world domination won’t be either.Spend the next two weeks reinventing yourself when Mercury enters Cancer on Sunday. Mercury in your career zone encourages you to think logically and strategically about your goals, ambitions, and public image. Who do you want to be, Libra? ","love":"    The news that comes with the sun-Uranus sextile in the beginning of the week might be a surprise, but it will probably be exciting nonetheless. If your love life needs a wake-up call, this is it!Your ruler Venus is partnered with fiery Leo as she opposes hardworking Saturn in air sign Aquarius early the week, which means you will fight for what you believe is yours. If you’ve been making progress in a romantic situation, don’t let anyone stand in your way.The new moon in moody Cancer over the weekend could cast a shadow over something you were really looking forward to, but sticking close to home has its advantages. If someone cancels a date, try not to take it personally. There could be a million reasons why they did it.","career":"    Resolve to be especially patient and avoid emotional outbursts now. Don't resist big changes that you didn't expect. The outcome of unsettled times will be better than you think. Expect more support from co-workers and bosses and an easier flow of communication. This can be particularly positive if you're in human resources or managing other people's resources. If possible, avoid being critical of co-workers or conducting performance reviews now.","wellness":"    Stay calm if you want to avoid high blood pressure or tension headaches. If you can adjust your attitude accordingly, life will be much easier and your body will function more efficiently. Your health is in your hands - or your head. The happier you are, the more your body will respond. Keep smiling!","money":"    Activity in your house of money and values this week means that something from the past has to be cleared up and dealt with before you can move forward again. Add to this the ingredients for an interesting money future. You're able to bring more to the table when you look to your house of debt or other people's money.","matches":[4,10,1],"ratings":[3,4,3,2]},"month":{"text":"   is filled with both success and love for you, Libra! Sweet Venus, dancing in your solar eleventh house until the twenty-first, guarantees that you’ll hear from many friends and could attend some dazzling events. If you’d like to try your hand at online dating or socializing with prospective suitors, do so prior to that time.However, the sun at the start of the month is instead focusing its light on your professional solar tenth house. The new moon arrives here on   9, opening a doorway for you to assess your ambitions and potentially take on more responsibility. News about a promotion, new job, or achievement could appear in the days that follow this new moon. Don’t just wait for it, though. Seize the day!A full moon in your solar fifth house of passion appears on the twenty-third. This is the first in two back-to-back full moons in Aquarius, and it could bring a turning point in a romantic, creative, or fertility concern.But with the planets at war at this time, untoward news may appear. Rest assured that things can still work out in your favor as a second full moon will arrive here next month, and benevolent Jupiter swoops in like a deus ex machina beginning on   28 for the coming six months. No matter how things work out, know that the universe wants you to be happy and will aid you going forward. Open your heart to greater horizons, Libra. You’ll be glad that you did.Standout days: 13, 22, 29Challenging days: 3, 23, 25","matches":[4,10,1],"ratings":[3,4,3,2],"money":[]},"year":{"text":"\nWow, what a year you truly have in store for yourself, Libra! 2021 emphasizes your true gift of communication bringing out the more creative qualities of your sign. You might even consider focusing your attention on your more artistic and altruistic forms of expression. As an air sign, you find yourself on a quest for knowledge and might even consider entering a program of study that expands your understanding of various subjects.\n\nThe north node's transit through Gemini directs your personal magnetism towards continued education, spiritual expansion, and even connects you to communities around the world. You might even consider directing your energy towards more humanitarian causes as Saturn's presence in Aquarius trines your sign and connects you to several causes that you feel most passionate about.\n\nYou are a sign that seeks diplomacy and justice, which you know does not happen overnight. You are willing to put in the time and effort to really see certain things through and know that this is a full-year process ahead. You might even consider volunteering your time with certain organizations, and find yourself continually inspired by the stories of others as you deepen your understanding and research within your community.\n\nA very enlightening lesson this year includes the cycles of Mercury retrograde, which are all in air signs. This begins with an Aquarian retrograde during the months of January and February, creating an editing period for your fifth house, affecting your children and creative talents. As Mercury retrograde asks us all to investigate things more deeply, this is also an important lesson for all your relationships.\n\nYou'll feel more challenged by a Gemini retrograde cycle from May through early  . This can be a bit tricky in your communication style, and bring unwanted confusion. The year also brings a healing Mercury retrograde in your sign of the Scales from late September through mid-November.\n\nIn general, there's a lot of activity in the second half of the year in terms of questions and resolutions involving love.\n","matches":[],"ratings":[],"money":[],"love":[],"career":[],"wellness":[]}},{"today":{"text":" Love is on your side today, Scorpio, and all romantic and social situations are favored. This is the perfect time to take the lead on creative projects or anything requiring a keen eye for beauty. Your mood is apt to be positive and jovial. You can't go wrong in whatever way you choose to express yourself.","matches":[6,12,3],"ratings":[2,4,2,2],"money":[]},"yesterday":{"text":"  It's time to settle down from the rapid-fire activities of the past few days and retreat to a quieter state of mind, Scorpio. Take care of the details you failed to attend to while you were out having fun. Now is the time to turn inward and reflect. Rely on your inner reserves as opposed to your outwardly directed actions. Stay grounded and let your emotions work with your rational side.","matches":[5,11,2],"ratings":[3,4,3,2],"money":[]},"tomorrow":{"text":" Put on a noble demeanor before you leave the house this morning, Scorpio. The key is to smile from ear to ear and just keep smiling. There's a great deal of power available to you, so put it to good use. Open your heart and freely express your love, because it will brighten up other people's lives, too. Keep your chin up, your shoulders back, and be proud.","matches":[5,11,2],"ratings":[4,2,2,4],"money":[]},"week":{"text":"    Start the week with an open mind when the sun in Cancer sextiles Uranus in Taurus on Monday. Being stubborn and sticking to your own ideas could cause tension in your relationships. To avoid an argument, try testing some unique ideas. It might surprise you.After opening your mind, start expanding it when the new moon is in Cancer on Friday. Spend the night thinking, plotting, and learning new things. Whether you’re planning a major trip in the future or considering higher education, spend this time reading, learning, and growing.New ideas continue to enter your life when Mercury enters Cancer on Sunday, where it will stay for the next two weeks. With the planet of communication in your philosophy zone, you’ll be able to understand and communicate abstract ideas with ease. Be open to learning new things and, most importantly, be open to being wrong. Yes, Scorpio, sometimes you’re wrong! ","love":"    With the sun partnered with sensitive fellow water sign Cancer this week, you give off serious â\u0080\u009conly looking for a long-time thingâ\u0080\u009d vibes. It’s not that your crush isn’t into you, but they might not be ready for so much so soon.Midweek brings a Venus-Uranus square that puts your love life through some changes that you really wanted to avoid. As a fixed sign, you like things to stay the same, and this aspect casts doubt on a lot. Stay focused on what you want, Scorpio.The Cancer moon has a homey, domestic influence on you over the weekend, and your best moments are those spent at home in a comfy environment. Your perfect date might be getting in your PJs and video chatting with your crush instead of getting all dressed up and dealing with annoying crowds.","career":"    Success at this time requires a slow and careful approach, especially if you want to break out of established structures and expand your horizons. These are wonderful days for networking and building support within and without. You'll be most effective making repeat visits or holding team meetings to support your interests. Friendships with customers or contacts you made through travel or education can be especially satisfying. Be honest about what you're doing.","wellness":"    The cosmos could be making you jumpy. You'll feel irritable and tired if you keep pushing yourself to do more than you have to. A dormant cold could suddenly worsen and cause you to lose time from work. Pace yourself, and talk through difficult issues. Avoid too many snacks if your stomach is sensitive.","money":"    This week try not to get too caught up in your own viewpoints or dig in your heels to get your way. It probably won't happen. Instead, look to your relationships, especially your close friends, mate, and co-workers, to see how you can benefit one another.","matches":[6,12,3],"ratings":[2,4,2,2]},"month":{"text":" Reach for the stars, Scorpio. Powerhouse Mars continues to propel you into the limelight as it blazes a trail in your solar tenth house of achievement. You could be tackling major projects and initiatives in  , as well as seeing awards, recognition, and promotions for previous hard work. If you aren’t happy with your current place in your industry, use this time to change direction.Also, at the start of the month, the sun is in fellow water sign Cancer and your solar ninth house of expansion. The new moon on   9 could open a doorway for you to soar in a new direction, opening your mind to endless new possibilities. Academic initiatives, media projects, immigration plans, or traveling pursuits could all become important at this time. Use this period to take action in these areas.Venus moves into your solar eleventh house of friendship beginning on the twenty-first, ensuring that you could attend some dazzling events and have quite a bit of fun in the weeks ahead. Mars joins Venus here on   29, guaranteeing a lively period too.Another point to watch this month is a full moon in your solar fourth house of domesticity on the twenty-third. This lunation is the first of two back-to-back full moons in Aquarius, which could bring a culmination to a home or family situation. As the planets clash at this time, though, disheartening news may appear. No matter what happens, step up and handle it.Standout days: 9, 12, 13Challenging days: 1, 8, 23","matches":[6,12,3],"ratings":[2,4,2,2],"money":[]},"year":{"text":"\nThis is an extremely important year for your powerful sign of the Scorpion. Several transits tug and pull at major points in your personal chart, bringing you brand-new perspectives, and also requiring you to implement decisions that contribute to both, your family and career life.\n\nThis combines several areas of your personal affairs and asks you to really look into your long-term arrangements from the perspective of a leader, caretaker, and healer. As 2021 brings along with it an influential square between Saturn in Aquarius and Uranus in your opposing sign of Taurus, this creates a prominent T-square in your own chart. This can be a difficult astrological energy most pointedly experienced during mid-February, mid-June, and the end of December, but leads to radical change in your overall life. There can be many unplanned events that ultimately decide your fate and affect your home and career situations. You might even consider moving for work, or relocating in some capacity.\n\nPluto, your home planet, enters a retrograde cycle through Capricorn between June 28 and October 7, making this timeframe a key zone to revisit what still needs to be accomplished in order to feel fully empowered and take back your personal authority in certain areas where you felt you lost your confidence. Some see you from the outside that have no idea what's been bubbling under the surface. Don’t lose sight of the big picture, and always remember that the universe wants you to succeed at anything you set your mind to, and this year is no exception to that rule.\n","matches":[],"ratings":[],"money":[],"love":[],"career":[],"wellness":[]}},{"today":{"text":" Certain love and romance matters may cause some tension, Sagittarius. Inflated egos may get in the way of important communication that needs to take place for harmony between you and your romantic partner. You're a bit more argumentative than usual. Sparks of disagreement are likely to flare into bonfires if you aren't careful. Keep a fire extinguisher handy.","matches":[6,12,3],"ratings":[4,2,2,4],"money":[]},"yesterday":{"text":"  This is an excellent day in which your thinking is clear and your emotions stable, Sagittarius. Use this powerful combination of a solid frame of mind and compassionate feelings to express yourself in a sincere, positive fashion. There's a great deal of power on your side helping you track down your goals and get exactly what you want.","matches":[7,1,4],"ratings":[2,4,2,2],"money":[]},"tomorrow":{"text":" You might find that your emotions are going through a powerful transformation, Sagittarius. Use it to add a bit of spice and passion to your day. Set the tone by showing people that you have something to say and you aren't afraid to say it. Put a humorous spin on everything you do. This attitude will get you through any locked door.","matches":[6,12,3],"ratings":[4,4,2,3],"money":[]},"week":{"text":"    While you’re ready for a big adventure, the universe is telling you to hold on when Venus in Leo opposes Saturn in Aquarius on Tuesday. You may be dreaming of traveling the globe, but you could be restricted to only short trips. With your wanderlust scaled down, try to make the best of it.The new moon in Cancer on Friday brings opportunities for growth and change as you move not only from one lunar phase to another but also to a new phase in your life. The changes you’ll undergo will be small at first but can lead to major impact later.The week ends on a transformative note when Mercury enters Cancer and your intimacy zone on Sunday. Bonds can be developed quickly through communication as conversations become more sensual and intimate. Over the next two weeks, you have to have some deep conversation that could change everything, so get ready. ","love":"    Are you ready for the changes that might come with the sun-Uranus sextile at the start of the week? Because, ready or not, here they come! Wait until you’ve confirmed surprising news before you act on it or tell anyone else about it, Sag.A Venus-Saturn opposition that also occurs early in the week reminds you that you have priorities that you should put above your love life and anything related to it. Although you might rather spend time swiping right, you know there are other things you need to be doing.Communicative Mercury leaves flirty Gemini to partner with sensitive water sign Cancer over the weekend, at which point you want deep, meaningful conversation that takes place in soft, muted voices. You might want to avoid other fire signs who don’t know where their volume button is now!","career":"    Powerful forces can continue to challenge the established structure of things now. You may have to accept the loss of some things you had counted on. Any weakness on the part of others shouldn't be allowed to ruin your day. These are good days for considering additional education or training to help improve your prospects. This time is best for steady work and attention to little details. Your ability to explain things will win points.","wellness":"    This could be an intense time, so keep yourself grounded. If you forget to feed and rest your body, you're going to be more prone to accidents and other health problems. Stay aware and you'll be able to maneuver through the days ahead. There could be a lot of stress around, so try to stay relaxed.","money":"    This week brings a potentially dangerous aspect. Something or someone looks so good that you don't think twice before jumping in. Even though that may be true, it's imperative to double-check all your facts and consider all the financial ramifications of partnership before diving in. Your future will thank you, as will your bank balance. The Universe will help to get the word out.","matches":[6,12,3],"ratings":[4,2,2,4]},"month":{"text":" At the start of  , you’re feeling the urge to merge, Sagittarius. This is due to the sun causing your intimate desires to sizzle!The new moon on   9 could open a doorway for you to assess the balance in your personal and business relationships. This same lunation is auspicious for applying for a loan or scholarship or negotiating extra benefits with your employer. News of a settlement or payout could also be coming your way.â\u009c¨Mark down the best dates for your zodiac sign with your Sagittarius Monthly Horoscope! â\u009c¨Fiery Mars blazes a trail through fellow fire sign Leo all month, bringing you more energy to move toward your personal and professional goals. You could also be especially busy with an academic, media, or international matter.Sweet Venus begins to grace your solar tenth house of professional success on the twenty-first, beginning a long trend of planets moving through this sector. Get ready to be in the spotlight for quite some time.The full moon on   23 falls in your solar third house of communication and could bring a culmination to a writing, speaking, advertising, or social media endeavor.This is the first of two back-to-back full moons spotlighting Aquarius. Of the two, though, the first one could be a bit more problematic and throw some obstacles in the way of your plans. Be flexible but proactive. This will aid your movement forward while also preparing for the hiccups that are bound to occur. You have what it takes to make   a milestone month in your 2021 storybook, Sagittarius.Standout days: 13, 24, 29Challenging days: 6, 9, 23","matches":[6,12,3],"ratings":[4,2,2,4],"money":[]},"year":{"text":"\nWhat an absolute turning point kind of year 2021 will be for you, Sagittarius! There is a miraculous energy all around you that is quite refreshing for your benevolent sign of the Centaur. You will have times of massive self-reflection that can trigger old wounds, also met by extremely gracious moments of friendship!\n\nThe presence of the lunar and solar eclipses cycle through both, your personal sign and opposing realm of the Twins. This helps you get a full perspective and observe the world through a brand-new scope. You have various mass realizations this year that will set you on a successful course.\n\nThe May 26 total lunar eclipse in your sign, for example, provides a massive release in your personal life that is both purifying and strengthening. This can be an energetic blockage you've had for years that lifts and releases from your life. You may feel more exposed than normal, but that is the point of these shifts.\n\nLater on, as an illuminating annular solar eclipse in Gemini galvanizes your personal seventh house of partnerships on June 10, there is no place to hide! You are out and proud of whatever you believe in!\n\nThe goal this year is to get you expressing from a more heartfelt space. Appreciating life, and living it up is what it's all about these days. Even with the hardships of the world, your Jupiterian sign can really feel the love even through the tougher of times. The year concludes with a total solar eclipse in your sign on December 4, igniting your passions and bringing fruitful messages from the cosmic forces that be!\n","matches":[],"ratings":[],"money":[],"love":[],"career":[],"wellness":[]}},{"today":{"text":" Take charge of your life, Capricorn. The more action you take, the more alive you will feel. Maybe you will decide to have a career on the stage. This is the kind of day when you need more variety than usual. Bright and happy people will catch your eye. Jump on the fast track. You're ready.","matches":[7,1,4],"ratings":[4,4,2,3],"money":[]},"yesterday":{"text":"  Turn your energy inward today, Capricorn. Make a detailed list of what you need to get done in order of priority. It's time to take inventory and get organized. Detail-oriented projects are favored, and you have much more patience and concentration than usual. Slow down the pace and remember to smell the roses as you pass by.","matches":[7,1,4],"ratings":[4,2,2,4],"money":[]},"tomorrow":{"text":" Give special attention to others today, Capricorn. Remind people how much they mean to you. Adopt a childlike attitude of excitement and adventure. This is the name of the game on a day like this. Let the sunshine touch your spirit regardless of the weather. There is extra fuel for your fire. Get out and do the things you love to do.","matches":[8,2,3],"ratings":[4,3,2,4],"money":[]},"week":{"text":"    Financial matters could affect your relationship when Venus in Leo opposes Saturn in Aquarius on Tuesday. You might be sharing resources with another person, but you want to spend some money on yourself. Have a serious talk with your partner before spending the money or you could be sorry.Luckily, partnerships become favorable when the new moon is in gentle Cancer on Friday, creating an excellent day to start new partnerships of all kinds, from business to romantic. Test the waters a little first before you make it official, however. Baby steps, Capricorn.Finally, the week ends on an agreeable note when Mercury enters Cancer on Sunday. The planet of communication will be in your partnership zone for the next two weeks. Use this time to finalize details and think carefully about any agreement you’re considering or partnership you might enter. Trust your gut in every situation. ","love":"    There’s a sun-Uranus sextile at the start of the week that could bring an issue to light that you might not have expected, Capricorn, but you aren’t any the worse for it happening. Your long-term romantic goals will most likely remain intact despite the shake-up.The opposition between loving Venus in dramatic Leo and serious Saturn, your ruler, in offbeat Aquarius happens around the same time, offering you some solutions that you might not have thought of before. Are they a little out there? Yes, but desperate times call for desperate measures.The end of the week provides hope in the form of a Cancer new moon. Shed the negativity you’ve been feeling and embrace the possibility of true love. Your soul mate might be right around the corner, literally. Don’t rule out neighbors and people you see every day near your house (delivery people, bus drivers, grocery clerks) as potential lovers.","career":"    Although you must still deal with a certain number of limitations due to financial realities or people with more limited vision, remember that this is a powerful time to build for a better future. Teamwork and humanitarian efforts are especially favored. You might make a big difference in the life of a co-worker. Be cautious about making assumptions in any area concerning finances. Carefully review any legal documents. Do your best to eliminate distracting fantasies. Test ideas carefully.","wellness":"    You could feel on edge and be more prone to stress. It isn't serious, but it could be enough to make you tense if you don't consciously avoid it. Watch out for minor accidents caused by your mind being elsewhere. The cosmos might encourage you to eat more than usual. Don't feast on treats - eat well.","money":"    You have an interesting money week ahead. This can be extremely fortunate, so keep your eyes peeled for all kinds of new opportunities to earn money and get any money that's already coming to you. The Universe affects the way you're currently paying off your outstanding debt. Slow and steady wins the race every time.","matches":[7,1,4],"ratings":[4,4,2,3]},"month":{"text":" At the start of  , the planets are speaking about partnership and intimacy for you, Capricorn.Fiery Mars is igniting your sensual side and sexual desires throughout the entire month, encouraging you to grow especially close to someone special. If there are any relationship traumas or fears bubbling beneath the surface, you can work through them now so that you don’t have to hold onto vulnerability or trust issues.This same energy could also be increasing your expenses, because the solar eighth house holds ties to large sums of money in the form of debts or loans.The sun and Mercury spend most of the month smiling at you from across the sky.The sweet new moon on the ninth, spinning in her dazzling white dress, reaches out her hand to you, encouraging you to make promises and commitments to your significant partner in love or business. Some coupled Capricorns may make long-term plans together, move in, get engaged, or even marry. Single Capricorns can also utilize this energy to put themselves out there and set up meetings with prospective suitors who seem to have serious potential.Later in the month, a full moon in Aquarius and your solar second house of finances appears on   23. This lunation could bring a shift around money matters, perhaps a large expense, the end of a job, or perhaps a raise. This is the first in two back-to-back full moons in this arena, so while this first one could bring more heavy news than you’d like, the rest of the year looks more favorable for your financial life.Standout days: 5, 15, 20Challenging days: 1, 8, 17","matches":[7,1,4],"ratings":[4,4,2,3],"money":[]},"year":{"text":"\nYou have woken up to a different version of yourself this year, Capricorn! You are a unique soul that is here for a welcoming purpose on this earth! The presence of your home planet Saturn through the sign of Aquarius is in full force this year, and has many lessons for your sign of the Goat to take in and process.\n\nThere is some element of psychology pulling at you, which requires you to be wise beyond your years. You are experiencing a new world for yourself, and might even long for things to go back to the way they were. But the innovative influence of Aquarius will have you feeling more emotionally detached from your partnerships and friendships, pulling you into the future!\n\nAs a sign who often puts work over love, this can be a little easier for those Goats who just want some energy to jump into their professional life with zero constraints. For those who are ignoring your relationship duties because work gets in the way, this is a year where you can truly come face-to-face in this respect, and be open about your feelings.\n\nThere is some pattern that needs to be reassessed in your overall life. The difficult square between Saturn in Aquarius and Uranus in Taurus takes you away from the original structure you once perceived to be the rules, and now asks you to be a little more radical and step out of your own way. The turning points this year are not limited to mid-February, mid-June, and late December, but do bring on these squares in strong. This is a lesson that will test your self-esteem, but that is meant to cleanse your second chakra of creativity.\n","matches":[],"ratings":[],"money":[],"love":[],"career":[],"wellness":[]}},{"today":{"text":" Don't hide, Aquarius. This is your time to come out of the shadows. There's a spark within that's urging you to act. Move forward and worry about the consequences later. This isn't a good time to search every sentence for hidden meaning. People may be careless with their words. Don't overanalyze them.","matches":[9,3,4],"ratings":[4,3,2,4],"money":[]},"yesterday":{"text":"  Your head and heart are working in concert today, Aquarius. Things are coming together just as you expected them to. Have confidence in yourself. More than likely, you have the perfect solution to every situation. Maybe your incredible perception of the circumstances will catch someone off guard. Be prepared for some surprised reactions.","matches":[8,2,5],"ratings":[4,4,2,3],"money":[]},"tomorrow":{"text":" Proceed with passion, Aquarius. Get out of gloomy mode. Don't sit home and mope. Get out in the sunshine, literally as well as figuratively. Don't stay cooped up inside when there is a big world out there to explore. This is a day to keep things light and energetic. Remember that happiness is a decision.","matches":[7,2,5],"ratings":[3,3,3,2],"money":[]},"week":{"text":"    Yikes, Aquarius! Tuesday brings up boundary issues when Venus in Leo opposes Saturn in your sign. As you struggle to find balance between â\u0080\u009cweâ\u0080\u009d and â\u0080\u009cmeâ\u0080\u009d when it comes to your relationships, make sure you’re strict about your space. If you don’t create solid boundaries, people will walk all over you.Use the new moon in Cancer on Friday as an opportunity to work on yourself. This doesn’t mean pushing yourself into being productive. Rather, focus on taking care of yourself by starting some healthy habits and beginning a solid care routine that will last through all the phases of the moon.Continue to focus on self-improvement when Mercury enters Cancer on Sunday. Mercury will be in your habit zone for the next two weeks, encouraging you to think about your health and routines. Consider what you can improve and how you can use your time more productively.","love":"    You’re not trying to hide anything, right, Aquarius? So don’t let the news that comes out during the sextile between the sun and your ruler Uranus at the start of the week bother you whatsoever. Embracing the chaos of today’s announcement has interesting results.A Venus-Uranus square in the middle of the week puts stress around a unique situation and might make you feel like you have to defend yourself or your romantic choices. Here’s the thing, though: anyone who has long-term potential wouldn’t be doubting you now.Talkative Mercury leaves chatty Gemini to travel with soft-spoken, sensitive Cancer over the weekend, which changes the mood as well as most topics of conversation. Discussions between you and potential partners are more serious and future focused than you might feel comfortable with. If you don’t talk about it now, though, you probably never will.","career":"    Good luck and sudden changes are asking you to break with tradition and move in new directions now. People appreciate you and want to be helpful. Look before you leap. Have a more down-to-earth person review any big plans. Don't rock the boat. This is a good time to let others take the lead. Businesses concerning music, liquids, or compassionate service can see you shine.","wellness":"    Try not to get overheated this week. It's better to move slowly than it is to rush. A tendency to manipulate events linked with money could increase your blood pressure and make it more difficult for you to stay calm. Don't try force your agenda. It's better to let things fall into place and ensure your peace of mind.","money":"    You have a tension-filled week ahead. You may have to compromise more than you'd like. Your home life, more than your career or investment portfolio, is where you should look if you want to make more dough.","matches":[9,3,4],"ratings":[4,3,2,4]},"month":{"text":" With fiery Mars charging like a racehorse across the sky from you, Aquarius, partnerships are a top priority for you. This is because the red planet is igniting your solar seventh house of relationships, encouraging you to work as a team with someone important rather than fly solo. Committed Aquarians can make long-term plans together and make a tremendous amount of progress.Single Aquarians can also harness this energy by putting themselves out there to find someone special who wants to stay by their side. If you’re looking for the perfect collaborator, assistant, trainer, or other business associate, you can use this time productively.Next to note is the movement of the sun and Mercury in your solar sixth house of productivity. Your mind is especially focused on finding the right work\/life balance, as well as assessing your routine.The new moon on   9 could bring more responsibilities and projects from your employer or even the possibility of a new job. This is also an auspicious time to improve your fitness and diet regimen.However, a major turning point arrives when the full moon in your zodiac sign appears on the twenty-third. This is the first of two back-to-back full moons in Aquarius, showing that you’re in the spotlight once again. However, this first one could bring conflict, opposition, and challenges your way as you seek to assert yourself. Do your best to not lean into stubbornness. Be flexible or the universe could strike you down.Luckily, benevolent Jupiter swoops in like a guardian angel, returning to your zodiac sign on   28, where it remains for the next six months to help you.Standout days: 13, 22, 23Challenging days: 1, 6, 8","matches":[9,3,4],"ratings":[4,3,2,4],"money":[]},"year":{"text":"\n2021 is the year to be an Aquarius! It is all about your ever-evolving sign that presents a unique and accepting perspective to the world at large. You are here to really provide inspiration to the planet as everyone around you seems to be super confused about where to turn next.\n\nYour Water-bearing sign is ready to embrace and fully appreciate the amazing vibration gifts the universe has in store! It is truly a time to ask your spirit guides for what you want, and find a surprise waiting for you around every corner!\n\nAs Saturn briefly entered your sign in 2020 experiencing a six-month retrograde cycle, you've gotten an idea of where you are headed this year. The structured planet is now transiting through your eccentric sign that enjoys the unknown twists and turns that bring forward many surprises and adventures.\n\nThe year is marked by some intense squares between Saturn in your sign and Uranus in the fellow fixed sign of Taurus. Because you are co-ruled by both of these two outer-bodies, this is going to be an exponential lesson for you.\n\nThere is a strong connection to time itself these days. You might feel throughout the year that time is either moving extremely fast or slowed down to a glacial pace. The most pointed squares being present on February 14, June 14, and December 24 will really test your sense of time in general. The entire purpose of this energy is to align you with your spiritual awareness and allow you to make decisions from your sense of intuitive awareness.\n","matches":[],"ratings":[],"money":[],"love":[],"career":[],"wellness":[]}},{"today":{"text":" This is a terrific day for you, Pisces. Your mood is good and everything is flowing your way. The fire within is burning hot. You will take the lead role in every production. Romance and love are definitely in the cards for you. Be yourself and remember that it's OK to laugh at your mistakes. Humility is good for you.","matches":[8,3,6],"ratings":[3,3,3,2],"money":[]},"yesterday":{"text":"  Get in touch with your vulnerable side today, Pisces. Don't pretend to be someone you're not. Realize that you can be yourself and still have a good time without needing to hog all the attention. Stabilize your mind and create space to grow. Take some of the advice that you give to others and apply it to yourself.","matches":[10,4,5],"ratings":[4,3,2,4],"money":[]},"tomorrow":{"text":" This is your day to shine, so turn it up a notch, Pisces. Brush your hair before you go out, and make sure you're wearing flattering attire. You have the chance to propel your emotions into an upward spiral. If there's a part of your life that feels stagnant, give it a jolt of creative energy or simply remove it from your life.","matches":[9,3,6],"ratings":[2,2,2,3],"money":[]},"week":{"text":"    Tuesday brings family drama when Mercury in Gemini squares Neptune in your sign. As family members try to meddle in your personal affairs, you might feel rebellious and jump into a situation just because they tell you not to. Don’t let defensiveness cause you to make mistakes. Try to express yourself before making a major decision.Stay in and get creative when the new moon is in Cancer on Friday. Leisure is your top priority as you focus on relaxation and fun. Whether you’re working on a creative project, watching your favorite shows, or having a little romantic evening with a lover, enjoy it!Your week ends on a delightful note when Mercury enters Cancer and your pleasure zone on Sunday. The next two weeks will be a very creative time as you express yourself with joy and ease. Pleasure can be gained through self-expression, Pisces. ","love":"    With the sun hosted by security-seeking Cancer this whole week, you’re most at home with other people who share your emotional depth and sincerity. Use your intuition to weed out potential partners who just don’t get you or who call you â\u0080\u009cneedy.â\u0080\u009dThe middle of the week brings a Venus-Uranus square that aims to cause some tension in a new relationship or one with an ex. Just when you thought you had it slightly figured out, you begin to question yourself again. Don’t let someone else’s negativity raise doubts.The new moon in shy Cancer at the end of the week brings out your introverted side and makes you wonder if you’re really just meant to be alone. It’s okay if you don’t feel like looking for love right now, Pisces. The mood is right for some serious self-care and pampering.","career":"    There could be power struggles now. It's vital to be very honest. The times can bring some to a crossroads. Maybe you should do something else, or perhaps you should keep your head down and keep your job. The energy at work now can make you especially sensitive to subtle undercurrents. Trust your intuition. An easier flow begins soon. People will be more supportive and you'll feel increasingly confident.","wellness":"    Keep up your research into any health issues. You have all the help from the cosmos that you need to find the facts. Don't stick with the tried and true. Instead, look at alternatives and listen to what people say about their results. Once you've gathered enough information, you can make an informed decision. Trust that you'll know what to do.","money":"    Your thoughts and ideas may turn to family and fun now, but the Universe is pushing you to think about larger institutions as a way to earn money. If your money is in a small, local bank, it may be time to give the big boys a chance. Better rates and savings options mean more money for you and your clan.","matches":[8,3,6],"ratings":[3,3,3,2]},"month":{"text":" With powerhouse Mars igniting your solar sixth house of productivity, Pisces, you are especially busy this month. You may be hard at work with your employer, hustling on important projects, or even chasing down important fitness goals. Don’t let yourself burn out, though, because the fire of Mars could see you burning the candle at both ends.The new moon on   9 falls in your solar fifth house of love and recreation, so it’s time to make your heart’s desires a priority. This new moon could open the doorway for single Pisces to find true love or at least line up prospective suitors. Committed Pisces should utilize this period to set up time for romance, because you could reignite the spark in your union or even have luck in fertility. If you’re a creative, this is the most auspicious new moon of the year to immerse yourself in new inspiration.Magical Venus turns a corner to dance across from you in the sky beginning on the twenty-first, setting up a trend of several months with planets in your solar seventh house of partnership. Commitments and engagements could be right around the corner!Next to note is the full moon in your solar twelfth house of rest on   23, which could see you very tired and in need of solitude. Lie low and don’t rock the boat, because this full moon could make your anxiety spike.One last thing to say about   is that it is the final month in 2021 with your co-ruler Jupiter dancing in your zodiac sign. Plant some seeds, take chances, and attract luck to you everywhere you go.Standout days: 5, 12, 15Challenging days: 6, 17, 23","matches":[8,3,6],"ratings":[3,3,3,2],"money":[]},"year":{"text":"\nThere's a difficult energy to pin down this year, Pisces. You have to really take the approach of allowing life to come as it is for your sensitive sign of the Fish.\n\nThe most pivotal transit affecting your chart includes a series of eclipses between Gemini and Sagittarius that activate your personal tenth and fourth houses. These are more specifically your zones of career pursuits and family development. Whenever you feel like you are getting out-of-control this year, one strategy to take that will really help you is to always follow your grounded path.\n\nAs Uranus continues to break boundaries in Taurus, this outer planet is also met with a conflicting square with Saturn in Aquarius. This holds the element of extremes, especially in mid-February, mid-June, and late December; but sparks certain events that also affect your loving sign throughout the entirety of the year.\n\nYes, this energy will challenge you on many levels, especially through your personal realms of communication and psychic development. For those Pisces who are open to their gifts, this will be extremely easy for you, and for those who have suppressed your personal intuitive nature, this can feel a little overwhelming at times.\n\nYou are extremely in tune with the unseen world this year, and it can feel like you're able to predict things before they even happen! It is a good year to work with others that support you, and also share your gifts as well. During this fascinating year, your spiritual life might even deepen.\n","matches":[],"ratings":[],"money":[],"love":[],"career":[],"wellness":[]}}]