[
  {
    "today": {
      "text": " Legal papers might need attention today, Aries. This could concern a positive development in financial matters. Though you might not be too clear on the language, you will still be glad to do it since it could represent a highly desirable turn of events for you. New self-confidence could result. You could find more interesting people drawn into your aura. Sparkle and shine!",
      "matches": [
        10,
        4,
        7
      ],
      "ratings": [
        3,
        4,
        3,
        2
      ],
      "money": []
    },
    "yesterday": {
      "text": " A love partner may seem too quiet, Aries. Perhaps you haven't heard from your friend for a day or so. If you let it, this could start your doubts and insecurities, causing you to wonder if this person still cares or if they're gone forever. Try to remain objective. Does your friend have some worries right now? That may be why they're out of touch. Worry will only make you feel worse.",
      "matches": [
        11,
        3,
        8
      ],
      "ratings": [
        2,
        4,
        4,
        4
      ],
      "money": []
    },
    "tomorrow": {
      "text": " Spiritual matters could be very much on your mind, Aries. You may want to delve into metaphysical studies and meditation, but work or family responsibilities could interfere with making those desires a reality. Don't let this get you down. Instead, stay focused on the mundane chores and finish them. Then you can move on to the really fascinating matters.",
      "matches": [
        11,
        5,
        8
      ],
      "ratings": [
        2,
        4,
        2,
        2
      ],
      "money": []
    },
    "week": {
      "text": "  Monday brings opportunities for emotional healing when Mercury in Cancer trines Jupiter in Pisces. Talking to someone about your childhood or family issues can help you gain closure and heal. Score karma points by doing good deeds in private, Aries.However, Wednesday brings some emotional turmoil when Pallas retrogrades in Pisces. Keeping your emotions bottled up and hurting yourself on purpose won’t help you. Keep asking for help instead of suffering in secret, or you could seriously hurt yourself.You’re a fire sign for a reason, but when Chiron retrogrades in Aries on Thursday, try to focus on managing your fiery temper or you could blow up on someone important. Continue to focus on healing emotional wounds so you can stop getting angry at people you care about. Take care of your body during this time as well. Healing the relationship with your body will heal the soul. ",
      "love": "  Good news comes in many forms during the Mercury-Jupiter water sign trine at the start of the week. If you’ve been waiting for someone to return your text or DM, this could be your lucky day.With wisdom-producing asteroid Pallas going retrograde in intuitive Pisces midweek, you can trust your instincts. First impressions are everything. Even when people try to hide who they really are, you can see behind the act.Healing Chiron is in your powerful sign when it turns retrograde a bit later in the week, giving you the energy to face something from your romantic past. You prefer to live in the moment, but this issue is important enough to stop what you’re doing and give it your full attention.",
      "career": "  Those in service positions will find greater support and appreciation for their work now. Efforts that benefit more than one business at a time can be very successful. It's important to pay attention to accounting and cash-flow concerns. It's possible that there could be an unexpected flirtation that works to your advantage. This period is a powerful time to prepare to find or apply for a new job.",
      "wellness": "  You're motivated to focus on getting your body in shape. There could be a few difficult days in which you feel emotional. The aspects could leave you feeling drained. If you have a lot to do, try to delegate some tasks. You need to relax and process your emotions. You'll feel better in a few days.",
      "money": "  You have an interesting situation this week. Your life may be more difficult than it needs to be, especially when it comes to what's yours. Defining how you're going to earn money now and in the future is better than leaving it all to chance. Trusting others too much isn't the best bet now.",
      "matches": [
        10,
        4,
        7
      ],
      "ratings": [
        3,
        4,
        3,
        2
      ]
    },
    "month": {
      "text": " Dig deep and evaluate your emotional security, Aries. The sun and Mercury can help you to tap into your intuition and practice more self-awareness. While you could feel a bit more emotional if you haven’t been feeling the most stable as of late, the planetary energy should help you be proactive about how to improve this and integrate more self-love.The new moon in your solar fourth house appears on  9, opening a doorway to make improvements in your domestic sphere. Some Aries could decide it’s time to move or fix up their space. If a parent or family member needs help at this time, step up to aid how you can.Fiery Mars, your ruler, remains ignited within your solar fifth house of passion throughout most of the month, meaning you’re in the mood to have some fun and be romantic. This is the best period in two years for single Aries to put themselves out there to find someone new. Creative and fertility concerns are also favored.The full moon in your solar eleventh house of friendship appears on the twenty-third and may bring a culmination, turning point, or ending regarding your social life. Bad news regarding an acquaintance could come your way near this time. Hopefully, though, you’ll be able to sidestep the problem through your resourcefulness and lighthearted attitude.To end the month, on  28, benevolent Jupiter sweeps into your social sector like an angel, raining showers of happiness and prosperity down upon you for the rest of the year.Standout days: 13, 22, 24Challenging days: 1, 9, 17",
      "matches": [
        10,
        4,
        7
      ],
      "ratings": [
        3,
        4,
        3,
        2
      ],
      "money": []
    },
    "year": {
      "text": "\nThere is a great deal to be learned through the other side of the story these days, Aries. 2020 brought out your more practical and protective side. You were forced to dive so deeply inward, and now you know what you are able to take, and what you can no longer tolerate in your life.\n\nAs you pummel into 2021 with your naturally inquisitive nature, there can be an honest review of where you want to direct the show. This means that you must take authority back in some capacity throughout the year.\n\nSaturn's influence in Aquarius sextiles your sign nicely, giving you a boost of confidence in your career pursuits. This energy can even help you heal some issues around respect and open your mind to new and different methods of leadership. This holds true for you even when a square formed between Saturn in the Water-bearing sign and Uranus in your neighboring sign of Taurus on February 17, June 14, and December 24. There's a direct emphasis on your self-worth during these months as you become more aware of what is best for the greater good.\n\nYou might feel torn at times if you are striving hard and finding strength by following your own direction. If you keep your eye on the prize, you will not leave anyone behind. In fact, you are carving a lesser-known path to lead the way for an entire community. This year, certain lunar eclipses vacillate between Sagittarius and Gemini, activating your personal zones of higher learning and spiritual development, and requiring you to find the words for what you are feeling.\n\nIn 2021, you might have many moments of precognition or feel more in alignment with your intuition, especially surrounding the Sagittarian eclipses, being a May 26 total lunar eclipse and a total solar eclipse on December 4.\n",
      "matches": [],
      "ratings": [],
      "money": [],
      "love": [],
      "career": [],
      "wellness": []
    }
  },
  {
    "today": {
      "text": " A new romance or friendship could develop with someone who's very creative and shares your spiritual values. This is a very positive development, Taurus. Just avoid idealizing your new friend. This person is human like everyone else, and needs to be loved as is. Don't create an unrealistic impression of the person. If you acknowledge and accept this, a rewarding new relationship could result.",
      "matches": [
        12,
        6,
        9
      ],
      "ratings": [
        2,
        4,
        2,
        2
      ],
      "money": []
    },
    "yesterday": {
      "text": " Possible ideas for artistic projects could come to you, Taurus, though some of them may be vague and not yet ready to manifest. You may seek to express your spiritual side through artistic activity, but might not quite have a handle on how to do it. Don't force it. Find something else to do and let it sit for a while. You might be surprised by the final results.",
      "matches": [
        11,
        5,
        8
      ],
      "ratings": [
        3,
        4,
        3,
        2
      ],
      "money": []
    },
    "tomorrow": {
      "text": " A friend may seem in a dark and gloomy mood and unwilling to talk about it. Don't force the issue. This probably has more to do with your friend's circumstances than with you, Taurus. It's best if you continue to pursue your cherished goals. Not only could you advance your interests but you might also inspire your friend and bring him or her out of the dumps. Go for the gold.",
      "matches": [
        11,
        5,
        8
      ],
      "ratings": [
        4,
        2,
        2,
        4
      ],
      "money": []
    },
    "week": {
      "text": "  Are you feeling a little obsessed, Taurus? As Pallas retrogrades in Pisces on Wednesday, you could become more fixated on noticing what others have that you don’t. This can lead to jealousy. Take a break from social media and work on helping others instead of focusing on what you feel is missing from your life.Continue to focus on self-acceptance when Chiron retrogrades in Aries and your privacy zone on Thursday. You might decide to heal your emotional wounds in solitude. Use self-love to help guide you through this period as you step out of the darkness and into the light.Your week ends on a positive note when the sun in Cancer opposes Pluto in Capricorn on Saturday. Explore ideas that differ from yours without obsessing over what is the “right” opinion. Instead, expand your mind and talk without ego. You’ll learn more. ",
      "love": "  You can use the good energy coming off the Mercury-Jupiter trine in the beginning of the week to look forward to the future. Follow up when you learn that someone is interested in you from a friend or social media. Make something happen. Give yourself something to look forward to!The middle of the week brings a sun-Neptune trine in emotional water signs that puts your romantic dreams in the spotlight. Did you ever think that you’d be in a position to make one of them come true? You don’t have to pinch yourself, Taurus. You’re not dreaming this time!Asteroid Chiron has healing abilities, and when it goes retrograde in fiery Aries midweek it’s wise to do some soul searching. If there’s one issue that’s keeping you from moving forward, you can get some much-needed closure now. Work on forgiving yourself before forgiving anyone else.",
      "career": "  Your mind will be very active, and you can shine at marketing or in any work that allows you to share your philosophy or the basic mission of your organization. Situations that have been delayed will begin to see progress. Educational and training opportunities can make a huge difference on the job. You can participate in team meetings that help everyone feel more empowered. This time is lucky for preparation that could lead to a better position.",
      "wellness": "  Events may cause a minor crisis. Some days could be stressful, so if your energy flags, it's a good indication that you need to relax your body. Do less rather than more. Nervous tension could be with you for some time. As the days unwind, pamper yourself and feel the benefits.",
      "money": "  You're right in the thick of it this week with aspects in your houses of home, inner feelings, and personal expression. The way others perceive you is changing. Step up and show them how you want to be seen.",
      "matches": [
        12,
        6,
        9
      ],
      "ratings": [
        2,
        4,
        2,
        2
      ]
    },
    "month": {
      "text": " Let your voice be heard, Taurus. With the sun and Mercury moving through your solar third house of communication through most of July, you have a deeply important message that you’re ready to tell the world.The new moon on  9 falls in this sector and could help you take the next steps in a writing, speaking, advertising, or social media endeavor. Fine-tune your approach and know the stars are in your favor to persuade the audience you’d like to reach. This same lunation could bring a new contract your way as well.Next to note is that mighty Mars continues to heat up your solar fourth house of domesticity all month, and this likely sees you especially busy with a move or renovation. You could also be very focused on stepping in to aid a family member in need.The full moon this month arrives on the twenty-third, the first of two back-to-back major lunations to highlight your solar tenth house of achievements. While this full moon could lift you into the spotlight, bring news of a promotion, or see that you’re quite busy with work, it appears there could be some hiccups or obstacles at this same time.Keep persevering, because benevolent Jupiter swoops in to aid you starting on  28 and for the rest of the year. It’s clear that, even if the burden is heavy, you’re stepping up higher than ever before. You have what it takes to succeed, Taurus.Standout days: 5, 13, 20Challenging days: 3, 8, 17",
      "matches": [
        12,
        6,
        9
      ],
      "ratings": [
        2,
        4,
        2,
        2
      ],
      "money": []
    },
    "year": {
      "text": "\nWelcome to a brand-new year ahead of you, Taurus! There's a ton of unpacking you have yet to do, and yet you do not even know where to fully begin. You've been experiencing the lessons of having the planet of chaos charging through your sign with both glimpses in 2018 and moving full-on in 2019. However, this year adds a bit of strife to this energy.\n\nUranus does not like constraints under any circumstances, and as Saturn opens the year strongly situated in fellow fixed sign Aquarius, you could find yourself in a continual crossroads. In fact, this is the overall energy of your year. Feeling like you are moving forward and being yanked into place having to wait for changes to take their full effect. You might see through things so much that at times, it might even anger you. This year requires a great deal of maturity and patience on your part. Yes, there can feel like great losses, mainly not through your own undoing, but through the continual clash between Saturn in the Water-bearing Aquarius and outer-body Uranus in your sign.\n\nThe year's lunar cycles are eye-opening in your personal zones of self-acceptance and spiritual growth. The May 26 total lunar eclipse in Sagittarius does shed light on those areas of your life that you've tried to sweep under the rug. Understand that eclipses are galvanizing energy that truly wants you to get real with yourself so that you may heal from this situation. The annual solar eclipse in Gemini on June 10 can add some clarity to your overall financial destiny—also reflected with a partial lunar eclipse in your sign of the Bull on November 19. Then luckily, you'll feel the weight off your shoulders on December 4 as the total solar eclipse sees you revisiting certain events and scenarios around your karmic connections, this time with a renewed sense of self.\n",
      "matches": [],
      "ratings": [],
      "money": [],
      "love": [],
      "career": [],
      "wellness": []
    }
  },
  {
    "today": {
      "text": " You could have heightened psychic awareness today, Gemini. You will probably notice it first when you pick up thoughts and feelings of family members, perhaps coming up with the same words at the same time. You may notice this phenomenon more throughout the day. You might experience visions or powerful premonitions. Make the most of this ability. It can increase your understanding of others.",
      "matches": [
        12,
        6,
        9
      ],
      "ratings": [
        4,
        2,
        2,
        4
      ],
      "money": []
    },
    "yesterday": {
      "text": " A close friend or romantic partner may seem in a rather quiet mood, Gemini, and disinclined to communicate with you. You might wonder if this person is angry with you or if you've said or done something that wasn't OK. It's likely that what's bothering your friend has more to do with work, family, or money than with you. Just make it clear that you're there if needed.",
      "matches": [
        1,
        7,
        10
      ],
      "ratings": [
        2,
        4,
        2,
        2
      ],
      "money": []
    },
    "tomorrow": {
      "text": " Professional interests might temporarily interfere with your social life, Gemini. This might cause a little friction between you and a close friend or romantic partner. Your friend is more apt to want to brood than discuss it with you. Don't worry. This person will come out of the funk and be more understanding. Explain the situation the best you can and then continue with your work.",
      "matches": [
        12,
        6,
        9
      ],
      "ratings": [
        4,
        4,
        2,
        3
      ],
      "money": []
    },
    "week": {
      "text": "  After embarrassing yourself publicly last week, you have a chance for redemption when Mercury in Cancer trines Jupiter in Pisces on Monday. Your valuable ideas can help you in your career and boost your self-esteem. Show your bosses just exactly why you’re an asset to the team.However, be careful when it comes to success. On Wednesday, Pallas retrogrades in Pisces and your career zone. Obsessing about making a name for yourself in your career could lead to your downfall if you overlook the little things in life. Try to create a healthier work\/life balance so you don’t add extra stress to your life.Get a jump-start on that balance when Chiron retrogrades in Aries and your friendship zone on Thursday. This encourages you to get your social life back on track. Take baby steps when meeting new people and entering new friendships. ",
      "love": "  With the brilliant sun radiating caring Cancer energy this week, you’re on the precipice of meeting someone very special. Although you might not be looking for anything serious right now, you won’t be able to let this one go.Asteroid Pallas goes retrograde while in sensitive, intuitive water sign Pisces midweek, providing you with the answers you’re looking for via subconscious clues. Pay attention to dreams, strong first impressions, and gut reactions to make sure you’re on the right track toward love.There’s a stressful sun-Pluto opposition over the weekend that is a double-edged sword. On the one hand, deep down you know you deserve the best that love has to offer. On the other, you question your ability to love someone fully. Once your deepest thoughts are revealed, there’s no going back.",
      "career": "  You may have strong feelings about your career or work situation now. This is a lucky time for recognition from superiors. A positive attitude can help advance your standing with co-workers. Women will need to do their best but not hide their femininity trying to fit in. Be yourself. Frustrating situations can start to move forward. If you need a new or better job, this period is ideal for preparing to make an application.",
      "wellness": "  Keep your thoughts about yourself upbeat and very positive. This will have an effect on your health. The way you think is crucial to your well-being, and you can see this firsthand. As you become elated, rebellious, assertive, or confused, you'll notice that your body responds accordingly. Act on this information.",
      "money": "  This week is about the exciting yet somewhat daunting activity in your communication sector asking you to become more professional in your way of speaking. Although things may feel tense, it's an excellent opportunity to go deeper into spiritual practices like meditation and yoga, especially if they help you process new ideas that can eventually earn you more money.",
      "matches": [
        12,
        6,
        9
      ],
      "ratings": [
        4,
        2,
        2,
        4
      ]
    },
    "month": {
      "text": " You have a sharper mind and more clarity for the first time in weeks with your ruler Mercury returning to normal speed this month, Gemini. It remains in your zodiac sign until  11, helping you articulate what was amiss before.Also, with fiery Mars igniting your solar third house of communication all month, you’re ready to declare the most important messages within your soul to the world. Use the energy to persuade the audiences before you that your ideas are the ones with promise. You could also be especially focused on launching a writing, speaking, advertising, or social media initiative at this time.A full moon in your solar ninth house of expansion also appears this month on the twenty-third. This is the first in two back-to-back full moons and could bring a culmination to an academic, media, immigration, or traveling initiative. No matter how, seek to integrate more ideas and wisdom into your inner world. Some Geminis might decide it’s time to return to school, while others may see the arrival of their first published work. With your mind so active, you could find yourself especially inspired.To end the month, benevolent Jupiter, who has sat perched at the top of your chart bringing professional success in recent weeks, once again dips his toes back into this same solar ninth house beginning on  28. Use the time before this to evaluate your professional goals and how you can soar even higher.Standout days: 12, 24, 29Challenging days: 6, 23, 25",
      "matches": [
        12,
        6,
        9
      ],
      "ratings": [
        4,
        2,
        2,
        4
      ],
      "money": []
    },
    "year": {
      "text": "\nThere’s for sure plenty to talk about this year, Gemini! 2021 is a highly stimulating year for your creative sign. You are able to feel more aligned with your highest good, and can even make some pretty fantastic new friends along the way. You might actually be the go-to person when things get a little rocky, mainly because you adjust so easily and quickly to things and are able to see the humor in almost any situation.\n\nAs the year begins with some confrontational squares between Jupiter in Aquarius and Uranus in Taurus, you'll get a beneficial wave of abundance headed your way even through some gritty energy. This is also true in mid-February, May, and late December for you as Saturn's transit through Aquarius squares Uranus in Taurus, causing some chaotic waves in the world.\n\nThis can be tough on others through much of the year; but because Saturn will be nicely angled towards your airy sign, it will be bringing you many insights and brilliant moments. This can be that time where you find yourself in a very powerful way. Expect the unexpected and be extremely grateful for the gifts you receive, because you deserve them!\n\nOne important piece of the 2021 puzzle is to really consider the transition period of your birthday months. You might be a little caught up during this year's Mercury retrograde cycles, which all take place in air signs. One of the most important for you occurs on May 29, following a transformative total lunar eclipse in your opposing sign of Sagittarius. This is a vibe that will definitely have you rethinking a lot of different pieces of the story. And although it can be a highly enlightening time when it comes to all aspects of your life, there is still much work to be done through the summer. Especially because you are also met with an annular solar eclipse on June 10—at the same time Mercury continues a tricky retrograde cycle in your sign until June 22.\n",
      "matches": [],
      "ratings": [],
      "money": [],
      "love": [],
      "career": [],
      "wellness": []
    }
  },
  {
    "today": {
      "text": " Someone who lives near you who may not have said much to you before could suddenly strike up a conversation that results in a new friendship, Cancer. You could be wondering why you didn't speak to him or her before. You could share a number of interests, and because of that, you could learn about some new group activities. Don't push too hard, and don't idealize your new friend.",
      "matches": [
        1,
        7,
        10
      ],
      "ratings": [
        4,
        4,
        2,
        3
      ],
      "money": []
    },
    "yesterday": {
      "text": " The possibility of your pursuing new career opportunities, perhaps with more pay, might cause doubts and insecurities among family members, Cancer. They could be afraid that you will have less time for them. It's important that you reassure them, as their worries might escalate if you just let it slide. Make it clear that you're still there for them. This might alleviate their doubts and yours.",
      "matches": [
        1,
        7,
        10
      ],
      "ratings": [
        4,
        2,
        2,
        4
      ],
      "money": []
    },
    "tomorrow": {
      "text": " Responsibilities to work, family, or both could temporarily delay plans for a much-needed vacation. This could be a bit depressing, Cancer, but don't let it get you down. Take care of your responsibilities as quickly as you can and then move ahead with your plans. All signs are that this trip is important to you and should go ahead as scheduled.",
      "matches": [
        2,
        8,
        9
      ],
      "ratings": [
        4,
        3,
        2,
        4
      ],
      "money": []
    },
    "week": {
      "text": "  Distance may make the heart grow fonder, but when Pallas retrogrades in Pisces and your intimacy zone on Wednesday, distance could feel downright unbearable. This means that it could be very difficult to be far away from a loved one during this time. Overwhelming emotions could shake up your life, so find healthy outlets where you won’t lose your cool.Thursday brings the possibility of career setbacks when Chiron retrogrades in Aries and your career zone. An embarrassment or failure could make you rethink your current goals. Is your job fulfilling you or keeping you from fulfillment? Regroup, heal, and start over.Compromise is the key to contentment when the sun in your sign opposes Pluto in Capricorn on Saturday. This could be a lovely day for romance if you compromise with your partner. Try to see things from their point of view to create peace. ",
      "love": "  With the sun making its way through your moody sign this week, you can’t be sure how you’ll feel about someone one day to the next. If someone you’ve been getting to know better accuses you of sending them mixed signals, they’re probably right.The trine between the sun and Neptune in the middle of the week is water sign based, infusing your daydreams with sentimental emotions. You view love like a romance novel now, so where is your hero\/heroine? Wouldn’t it be nice if you could snap your fingers and they’d just appear?!With healing asteroid Chiron going retrograde in spontaneous Aries around the same time, you tend to make snap decisions that aren’t always accurate. If an ex apologizes for hurting you, why doubt them?",
      "career": "  This can be a very exciting week! It encourages new ideas. Teamwork and group meetings can spark a more progressive and effective attitude. This period brings an opportunity to shine. Proposals that may have met with resistance can at last find needed support. Unions and other forms of collective bargaining can support your interests now. You may find yourself in the middle of office politics. This is a powerful time to prepare for a job interview.",
      "wellness": "  Developing greater spiritual awareness connects you with your ability to influence your health. You'll notice how an inner pattern of behavior manifests as a health issue. You're in an upbeat, energetic mood that's going to keep you in good shape. Don't let another's casual assessment of your health affect you.",
      "money": "  Things come together in your house of money and values this week. It may explain why even though there are certain opportunities coming your way, some of them require more work or more education than you currently have or have time for. Don't worry. You're facing a time when you need to focus on the politics of your job. Take the boss out to lunch.",
      "matches": [
        1,
        7,
        10
      ],
      "ratings": [
        4,
        4,
        2,
        3
      ]
    },
    "month": {
      "text": " With the mighty sun in your zodiac sign at the onset of July, it is your birthday season, Cancer! Now is the time to stand in your power and show the world that you’re a star in your own right. Your solar return is the most important time of the year to set goals, create intentions, and take actions to make new patterns for the year ahead.The loveliest new moon of the year arrives on  9. It falls within your zodiac sign and spotlights your personal hopes, so use this time to put yourself first. Mercury, planet of communication, is in your sign from the eleventh to the twenty-seventh, making you especially persuasive and eloquent.Feisty Mars continues to power through your financial sector all month, increasing your focus on money matters. While this could cause your expenses to skyrocket, it can also give you a strong impetus to budget and work toward more prosperity.Next to note this month is the arrival of the full moon in your solar eighth house on  23. This is the first of two back-to-back full moons in Aquarius, and a turning point has arrived. Your intimate needs and the balance in your relationships will be discussed.This could also bring news about a large sum of money, perhaps in the form of a debt, loan, scholarship, venture capital, royalty check, or settlement. However, with the planets clashing with this full moon, there could be some disappointing news around this area too.Standout days: 5, 9, 15Challenging days: 3, 12, 17",
      "matches": [
        1,
        7,
        10
      ],
      "ratings": [
        4,
        4,
        2,
        3
      ],
      "money": []
    },
    "year": {
      "text": "\nYou are here for a major reason, and 2021 is one of those years where you've got to surrender to the outcome. You made some incredible changes during 2020 and are making some real headway. There were many ups and downs that could have felt a little more traumatic than normal, especially for your compassionate sign of the Crab.\n\nThis year really serves as looking at your life from an outsider's perspective. You're able to take an observer’s perspective and might even consider diving into some deep self-reflection that you once shied away from. Working in several facets of spirituality, body care, research, and expanding your mind, in general, is what 2021 is all about. There is nothing too out-of-the-ordinary for you right now, as you might even be more interested in either paranormal or occult-type studies.\n\nYou are extremely tied to the cycles of the moon, who's nodes now cycle between Gemini in the north position and Sagittarius in the south position. You are working out karmic cycles through learning your own patterns in communication and understanding what stories you've been told for far too long. You might even be faced with the truth about a family situation that you once spent far too much time trying to resolve. Maybe you've sacrificed your own happiness for the good of your loved ones only to come to terms with what you really want for yourself.\n\nThis is a year where you can really step into your own independence and gain a little emotional space from the judgments of others. There's a refreshing tone to your life once you accept the truth about something you've been stuffing under the rug. 2021, in general, is a time for you to face the music, and see how special you really are! Stop being so hard on yourself, loving Cancer!\n",
      "matches": [],
      "ratings": [],
      "money": [],
      "love": [],
      "career": [],
      "wellness": []
    }
  },
  {
    "today": {
      "text": " Some paperwork might need execution today, Leo. This may be tedious, but it's apt to open new doors for you and pave the way to more success and good fortune. Writing or speaking might be involved in some way, and modern technology plays a definite part in what you will be doing. This could lead to valuable contacts and new friendships. Explore your options.",
      "matches": [
        3,
        9,
        10
      ],
      "ratings": [
        4,
        3,
        2,
        4
      ],
      "money": []
    },
    "yesterday": {
      "text": " Worries about a relative who lives far away might plague you today, Leo. The situation isn't helped by the fact that you may not be able to reach them by phone or email. You may have to contact mutual friends who can give you the information you need. Circumstances probably aren't all that dire. There's probably nothing to be overly concerned about, but you need to hear this. Keep trying.",
      "matches": [
        2,
        8,
        11
      ],
      "ratings": [
        4,
        4,
        2,
        3
      ],
      "money": []
    },
    "tomorrow": {
      "text": " Your financial situation should continue to expand now, Leo. Believe in yourself. Don't worry if you hear rumors that make the future seem rather grim. This is probably misinformation coming from unreliable sources. Continue to work toward your goals. Meanwhile, check out the rumors and find the real facts. You will probably discover that all is far better than the gossipers claim.",
      "matches": [
        1,
        8,
        11
      ],
      "ratings": [
        3,
        3,
        3,
        2
      ],
      "money": []
    },
    "week": {
      "text": "  You like to move fast, Leo, but as Pallas retrogrades in Pisces and your intimacy zone on Wednesday, change could be moving too quickly even for your fiery nature. This could make change so overwhelming that you cling to the past for self-protection. However, this is an opportunity for rebirth. Let go of the past so you can move forward.Thursday brings unpleasant discoveries when Chiron retrogrades in Aries. You might need to unlearn some old habits, ideas, and beliefs during this retrograde when you realize they don’t represent who you are now. Be humble as you learn.After a draining week, you might prefer to spend the weekend in bed. However, when the sun in Cancer opposes Pluto in Capricorn on Saturday, you’re going to have to face the world to feel better. Your attitude toward life will improve after a shower and some food. ",
      "love": "  There’s an emotional water sign trine between communicative Mercury and expansive Jupiter to start the week that gets you feeling all warm inside. Luck is on your side now, so saying the wrong thing to your crush is highly unlikely. Can you feel it? Something good is about to happen!Knowledge-seeking Pallas is in dreamy Pisces when it goes retrograde in the middle of the week, so you might be slow to acknowledge things that are obvious to everyone else. Just remember that hoping something is true doesn’t make it so.A sun-Pluto opposition shows up over the weekend, giving you a glimpse of what could be if you had a little more confidence in yourself and your romantic abilities. There’s nothing worse than second-guessing yourself out of an amazing romantic opportunity. Believe that you deserve good things to happen to you.",
      "career": "  Your sense of fair play should be strong now. Don't let a sense of injury color your thinking. This is a positive time for health careers. If you have benefits on the job, it may be time to talk to human resources to make sure you understand your situation. These are positive days to gather all your resources to achieve a specific goal. People around you will keep you energized, and they can bring important contacts.",
      "wellness": "  There's a powerful flow of dynamic energy that you can tap into and use to your advantage. This could be followed by a period of frustration, which won't help your blood pressure. Stay cool. By doing so, you'll feel capable of anything. You need to be more careful if you're going out. You could be vulnerable to viruses now. Boost your immune system!",
      "money": "  You have a host of astrological aspects to choose from this week, many of which affect your work and money. First, your relationships could possibly be less than stable. You may need to count on someone else for that loan you'd hoped for. Aspects in your house of large institutions like banks and the IRS indicate you should be careful what you say and how you say it.",
      "matches": [
        3,
        9,
        10
      ],
      "ratings": [
        4,
        3,
        2,
        4
      ]
    },
    "month": {
      "text": " Take the lead, Leo. Powerhouse Mars continues to ignite your zodiac sign until  29. During this time, your energy level should be at an all-time high as you radiate magnetism, sex appeal, and dominance. Use this to fuel all of your personal and professional goals. Nothing can stop you if you fight toward it now!This can also give you the strength you need to set the patterns you’d like to follow for the coming two years. Mars only visits your zodiac sign once during that time, so make sure to work hard to launch things now.However, with a new moon in your solar twelfth house arriving on the ninth, you’re likely lying low, resting, and brainstorming. This is a great moment to be strategic about putting all the necessary pieces in place to make your greatest impact.As soon as the sun soars into your zodiac sign on  22, you’ll light up like fireworks with your birthday season here. Roar and show the world what you’ve got!A full moon in your solar seventh house of relationships arrives on the twenty-third. This is the first of two back-to-back full moons in Aquarius, showing a major turning point in your partnerships. While this lunation could bring you closer in the form of moving in together, an engagement, or marriage, there is also the possibility of a separation if you aren’t in alignment. Know what you want and what you’re worth rather than settle for less.Standout days: 13, 22, 29Challenging days: 1, 3, 6",
      "matches": [
        3,
        9,
        10
      ],
      "ratings": [
        4,
        3,
        2,
        4
      ],
      "money": []
    },
    "year": {
      "text": "\nThis is a huge year for your exuberant sign, Leo! There is so much going on, that it is often hard to keep track of all the wonderful goodies in store for your sign of the Lion! A major component of this year is also learning how to let go and surrender to the unknown.\n\nThe theme for your fire sign is to have the patience to know that it will all end up exactly the way it is supposed to be! Along these lines, you are met with incredible tests of faith throughout 2021 that will leave you flabbergasted at how awesome it is to be yourself! There will be some emotional tests and energetic changes, but with your commanding presence, you'll be able to handle it all with ease.\n\nThe year begins with a strong mid-January square between Jupiter in your opposing sign of Aquarius and Uranus in fellow fixed sign Taurus, creating a challenging T-square energy in your chart. This isn't the easiest of configurations to deal with at all, requiring extreme self-care in many circumstances.\n\nThis T-square affects all realms of your life, and is also brought around again with the Saturn in Aquarius square to Uranus in Taurus, spanning a cosmic influence through mid-February, mid-June, and late December. These will be time periods where you'll face a ton of internal and external friction, and in many cases, can be a certain straw that breaks the camel’s back with respect to your career, relationships, and public life.\n\nFinally, this year’s lunar eclipses will also trigger some important cycles highlighting your personal zones of self-expression, professional relationships, and community development in May, June, November, and December.\n",
      "matches": [],
      "ratings": [],
      "money": [],
      "love": [],
      "career": [],
      "wellness": []
    }
  },
  {
    "today": {
      "text": " Strong intuitive rapport with someone who lives far away could create a desire to contact this person. This is a good idea, Virgo, as this person may be going through a positive transition in life and eager to share the news. This communication could bring you closer together, so go for it. Whatever is happening with your friend could spill over into your life in some way.",
      "matches": [
        2,
        9,
        12
      ],
      "ratings": [
        3,
        3,
        3,
        2
      ],
      "money": []
    },
    "yesterday": {
      "text": " A check you may have been expecting in the mail may be delayed, Virgo, and you might not be able to contact whoever is sending it. You could worry over whether or not you will get it at all. This could be a classic case of getting worked up over nothing. The delay won't cause any lasting problems, just inconvenience and frustration. Hang in there. The money will come.",
      "matches": [
        4,
        10,
        11
      ],
      "ratings": [
        4,
        3,
        2,
        4
      ],
      "money": []
    },
    "tomorrow": {
      "text": " Today it may seem like home and family responsibilities are interfering with your social life, Virgo, including a get-together you really want to attend. Don't worry. All signs are that something unexpected will occur at the last minute that makes it possible for you to proceed with your plans. Try to take care of your duties as efficiently as you can so you can enjoy the evening.",
      "matches": [
        3,
        9,
        12
      ],
      "ratings": [
        2,
        2,
        2,
        3
      ],
      "money": []
    },
    "week": {
      "text": "  Your week begins on a positive note when Mercury in Cancer trines Jupiter in Pisces on Monday. It’s a day of connections. You could get asked out by a crush, hang out with friends, or volunteer to help others. Wishes can come true, so be open to receiving good things.However, the week could become a little overwhelming when Pallas retrogrades in Pisces and your partnership zone on Wednesday. This could create issues in your relationship. Whether you’re falling for someone with toxic behavior, competing with someone over a love interest, or feeling overwhelmed by a complicated relationship, things could get messy, Virgo.Letting go is never easy, but when Chiron retrogrades in Aries on Thursday, you have no other choice if you want to move on with your life. A rebirth is rarely easy, but it will be needed for you to step into your higher power. ",
      "love": "  Enjoy the warmth from the loving Cancer sun this whole week, Virgo. Let the details slip away as you embrace a more compassionate, caring perspective on love. Maybe the little things don’t matter so much after all.Wounded warrior Chiron goes retrograde in the middle of the week while partnered with fire sign Aries, so you’ll be more determined than ever to have an ex admit that something they did in the past hurt you. If they never acknowledge it, though, then what? You might have to find a way to move on without that apology.There’s a sun-Pluto opposition over the weekend that can cause self-doubt if you let other people’s thoughts and opinions eclipse your own positivity. Deep down you know what you’re capable of, so why let anyone else convince you differently?",
      "career": "  Stress and worry don't have to ruin your workweek. You do have the strength and clarity of mind to deal with whatever comes your way. High-pressure situations require a calm and careful approach. You can shine in any situation where you're serving the public. This is a powerful time for using your natural charm to get ahead. It's especially positive for speech therapy, public speaking, political writing, and sharing knowledge.",
      "wellness": "  Create and work with your artistic impulses. A wonderful influence is creating a dynamic flow of energy directly related to your health. Get out and do those things that fill you with passion. The blocks to well-being will vanish. If you're socializing a lot, rest and eat well. It's time to recommit to your health goals.",
      "money": "  This week you have a supportive aspect, a very powerful burst of energy, which is going to affect your daily work. Your workplace may not be all that stable or may give you mixed signals about your work from one day to the next. Beware of empty promises from someone in your social network. They aren't all they're cracked up to be.",
      "matches": [
        2,
        9,
        12
      ],
      "ratings": [
        3,
        3,
        3,
        2
      ]
    },
    "month": {
      "text": "  could be a sweet month for you, Virgo. While Mars continues to ignite your solar twelfth house for most of the month, you could be quite busy behind the scenes or working in solitude. This is a great period to be strategic as you plan ahead so that when the planets start to migrate into your zodiac sign, you can show the world what you’ve got!Venus showers you in radiance and pleasure from  21 on, while the red planet ignites you beginning on the twenty-ninth. Focus on putting yourself first and enjoying more fun, recreation, and intimacy. The sun further enhances this as it moves through your solar eleventh house of friendship at the onset of the month.The new moon dawns in this same zone on  9, opening a doorway for you to interact more with your network and community. You may hear of exciting news from an acquaintance or even attend a lovely event. Someone might even step in at this time to provide an introduction that allows you to move toward one of your greatest hopes and dreams.A full moon in your solar sixth house rises in the night of the twenty-third, the first of two back-to-back full moons in Aquarius, showing a shift in your employment or physical health. Some Virgos could start or end a job, but either way you’ll be especially busy. Assess your diet and exercise regimen, because you might need to change something if it isn’t working for you. On  28, benevolent Jupiter returns to this same sphere to act as your guardian angel.Standout days: 9, 15, 24Challenging days: 6, 17, 23",
      "matches": [
        2,
        9,
        12
      ],
      "ratings": [
        3,
        3,
        3,
        2
      ],
      "money": []
    },
    "year": {
      "text": "\nThis is a major career year for your sign, Virgo. Your analytical self will enjoy the hard work and dedication it takes to make your dreams become a reality, but you also get a little boost of love from the cosmic cycles as well. You've done a lot of good deeds for so many people that it's kind of your time to let some good be returned to you as well. The only problem is sitting still and letting yourself have some fun along the way!\n\nA major aspect this year is your tenth house and fourth house being influenced by the current nodal transits as well as the lunar eclipses. The moon’s north node of fate transits through Gemini and sits high in your zone of career development, asking you to enjoy life a little more even as you are often obsessed with staying in control. The south node in Sagittarius asks you to let go of what no longer serves your soul and wants you to let go of any false narratives that have held you back.\n\nMore specifically, your energy is tied to the May 26 total lunar eclipse, the June 10 annular solar eclipse, the November 19 partial lunar eclipse, and the December 4 total solar eclipse. These dates can help you set a schedule and look at the actual patterns unfolding in your life at these specific times. You're going to be challenged to the max, but you will find your way through your own destined path. Your earthy sign is being given a lot of chances to prove yourself this year, as you are meant to fully thrive in all realms of life, love, and business.\n",
      "matches": [],
      "ratings": [],
      "money": [],
      "love": [],
      "career": [],
      "wellness": []
    }
  },
  {
    "today": {
      "text": " Your intuition could bring you an interesting opportunity to increase your income in an unconventional way. Others may think the idea strange, Libra, but for you it's definitely worth considering. Check all the pros and cons, talk to people in the know, and then give it some serious thought. Whether this is the source or not, an increased level of financial security is strongly indicated now.",
      "matches": [
        4,
        10,
        1
      ],
      "ratings": [
        2,
        2,
        2,
        3
      ],
      "money": []
    },
    "yesterday": {
      "text": " You could suddenly experience an overwhelming wave of affection for someone you've just met, Libra, perhaps a potential romantic partner. Fantasies of the future could waft in and out of your mind. This should feel wonderful in one sense, yet it could also bring up all your doubts and insecurities. Does this person feel the same way? It's probably a bit premature to worry about that. Take it one day at a time and get to know your friend better.",
      "matches": [
        3,
        10,
        1
      ],
      "ratings": [
        3,
        3,
        3,
        2
      ],
      "money": []
    },
    "tomorrow": {
      "text": " You may wake up feeling strong and energetic, but as the day wanes, stress could cause you to feel tired and worn out. Be careful, Libra. You could become short-tempered around others. This won't happen if you avoid the temptation to go like a house afire first thing in the morning. Pace yourself and your relations with others should remain excellent throughout the entire day.",
      "matches": [
        5,
        10,
        2
      ],
      "ratings": [
        4,
        4,
        4,
        4
      ],
      "money": []
    },
    "week": {
      "text": "  Emotional blocks hit you hard when Pallas retrogrades in Pisces and your habit zone on Wednesday. During this retrograde, it could be hard to find the energy to be very productive. Remember to take proper care of yourself to stay healthy. You can’t find a new routine if you feel sick, Libra.Thursday is a time for healing when Chiron retrogrades in Aries and your partnership zone. The wounded healer is encouraging you to allow conflicts to die and to heal from old heartbreak. Life isn’t a competition, so let old grudges die. Move on.Finally, the weekend brings transformation when the sun in Cancer opposes Pluto in Capricorn on Saturday. You have the opportunity to expand your home life into something wonderful. The only thing stopping you is the fear of what people might say. Let go of the judgment of others and focus on your own happiness. ",
      "love": "  The energy from the positive Mercury-Jupiter trine at the start of the week gives you a feeling like maybe you can get what you want after all. Don’t hesitate to say what you want out loud. This is a great time to speak your desires into existence.Asteroid Pallas isn’t quite at home in sensitive Pisces, and as it goes retrograde midweek you might have a difficult time figuring out how to express your feelings. Logic has its place, but your emotions are important too.The combination of asteroid Chiron partnered with intense Aries also going retrograde in the middle of the week can encourage you to take risks that you aren’t ready for. Even though you’re in a hurry to make something happen, good things happen to those who wait. ",
      "career": "  Casual conversations at this time can lead to important breakthroughs as you brainstorm any plan or project. Don't be afraid to stand up for what you believe in. This is a positive time to develop skills using color, texture, art, music, or natural products. If you're looking for something new, this is an especially favorable period for farming, food markets, and agricultural interests. Street smarts can serve you well now. Trust your intuition if you're making a decision.",
      "wellness": "  You're doing well. People notice that you have an extra glow about you. You understand why it's so important to factor your body into your plans. You can't function if you suffer from chronic bad health. Find your own rhythm in order to operate at maximum efficiency. Don't let anyone interfere with your health plans.",
      "money": "  This week is about a tense aspect affecting your house of debt or other people's money. It's imperative that you adopt a new way of looking at the debt in your life. Pay it off, if you can, or start by using the plastic less often.",
      "matches": [
        4,
        10,
        1
      ],
      "ratings": [
        2,
        2,
        2,
        3
      ]
    },
    "month": {
      "text": "  is filled with both success and love for you, Libra! Sweet Venus, dancing in your solar eleventh house until the twenty-first, guarantees that you’ll hear from many friends and could attend some dazzling events. If you’d like to try your hand at online dating or socializing with prospective suitors, do so prior to that time.However, the sun at the start of the month is instead focusing its light on your professional solar tenth house. The new moon arrives here on  9, opening a doorway for you to assess your ambitions and potentially take on more responsibility. News about a promotion, new job, or achievement could appear in the days that follow this new moon. Don’t just wait for it, though. Seize the day!A full moon in your solar fifth house of passion appears on the twenty-third. This is the first in two back-to-back full moons in Aquarius, and it could bring a turning point in a romantic, creative, or fertility concern.But with the planets at war at this time, untoward news may appear. Rest assured that things can still work out in your favor as a second full moon will arrive here next month, and benevolent Jupiter swoops in like a deus ex machina beginning on  28 for the coming six months. No matter how things work out, know that the universe wants you to be happy and will aid you going forward. Open your heart to greater horizons, Libra. You’ll be glad that you did.Standout days: 13, 22, 29Challenging days: 3, 23, 25",
      "matches": [
        4,
        10,
        1
      ],
      "ratings": [
        2,
        2,
        2,
        3
      ],
      "money": []
    },
    "year": {
      "text": "\nWow, what a year you truly have in store for yourself, Libra! 2021 emphasizes your true gift of communication bringing out the more creative qualities of your sign. You might even consider focusing your attention on your more artistic and altruistic forms of expression. As an air sign, you find yourself on a quest for knowledge and might even consider entering a program of study that expands your understanding of various subjects.\n\nThe north node's transit through Gemini directs your personal magnetism towards continued education, spiritual expansion, and even connects you to communities around the world. You might even consider directing your energy towards more humanitarian causes as Saturn's presence in Aquarius trines your sign and connects you to several causes that you feel most passionate about.\n\nYou are a sign that seeks diplomacy and justice, which you know does not happen overnight. You are willing to put in the time and effort to really see certain things through and know that this is a full-year process ahead. You might even consider volunteering your time with certain organizations, and find yourself continually inspired by the stories of others as you deepen your understanding and research within your community.\n\nA very enlightening lesson this year includes the cycles of Mercury retrograde, which are all in air signs. This begins with an Aquarian retrograde during the months of January and February, creating an editing period for your fifth house, affecting your children and creative talents. As Mercury retrograde asks us all to investigate things more deeply, this is also an important lesson for all your relationships.\n\nYou'll feel more challenged by a Gemini retrograde cycle from May through early July. This can be a bit tricky in your communication style, and bring unwanted confusion. The year also brings a healing Mercury retrograde in your sign of the Scales from late September through mid-November.\n\nIn general, there's a lot of activity in the second half of the year in terms of questions and resolutions involving love.\n",
      "matches": [],
      "ratings": [],
      "money": [],
      "love": [],
      "career": [],
      "wellness": []
    }
  },
  {
    "today": {
      "text": " Social events could put you in touch with interesting people involved in intriguing fields like astrology, alchemy, and other occult sciences, or perhaps in social, political, or humanitarian causes. There could be a possible new love interest. You're going to enjoy these people, Scorpio, and probably want to see them again. You need to make the effort.",
      "matches": [
        6,
        11,
        3
      ],
      "ratings": [
        4,
        4,
        4,
        4
      ],
      "money": []
    },
    "yesterday": {
      "text": " New ideas for increasing your income, particularly if they involve extra work, could suddenly seem vague and uncertain today, Scorpio. Doubts and insecurities could sabotage the plans you were so ready for yesterday. Don't let this happen. Talk to others and judge what is and isn't workable, then concentrate on the former and move ahead. You don't want to miss some good opportunities.",
      "matches": [
        5,
        11,
        2
      ],
      "ratings": [
        2,
        2,
        2,
        3
      ],
      "money": []
    },
    "tomorrow": {
      "text": " A temporary lack of funds might interfere with creative projects or your ability to have fun, Scorpio. You might encounter an apparent coolness from a close friend or romantic partner that you might not understand. Don't make too much of it. This probably relates more to the person's general mood than to anything you've said or done. Your friend should be back to normal in a few days.",
      "matches": [
        4,
        12,
        1
      ],
      "ratings": [
        3,
        4,
        4,
        2
      ],
      "money": []
    },
    "week": {
      "text": "  This week brings some trouble with creativity and self-expression when Pallas retrogrades in Pisces and your sector of pleasure on Wednesday. You might feel creatively blocked or not find much pleasure in life, leading to frustration. Take a step back and try to relax. You might just need a break.Instead, focus on forming healthy habits, especially when it comes to your mental health. On Thursday, Chiron retrogrades in Aries, making your emotional health extremely important. On the road to self-improvement, you might have to learn some hard lessons about yourself, but this will ultimately make you a better person.These lessons could start when the sun in Cancer opposes Pluto in Capricorn on Saturday. You have a stubborn streak, Scorpio. However, if you cling to preconceived ideas, you won’t be able to grow or learn. Change tactics to communicate with others, and keep an open mind.",
      "love": "  The sun is in kindred water sign Cancer all this week, warming you up and making you more approachable. Although you still have plenty of secrets, you’re willing to open up to the right person. You’re most compatible with other water signs now.There’s a midweek sun-Neptune trine, also with watery emotional energy, that helps you exhibit loving, caring, and compassionate vibes. Pay close attention to your daydreams because the person you’re imagining or thinking about might just walk through the door!Chiron is in fiery Aries when it goes retrograde, also in the middle of the week, making you a little more impulsive than usual. Should you think things through before going back to an ex? Absolutely. Unfortunately, you have a hard time thinking things through when they’re in front of you looking better than ever.",
      "career": "  Your analytical ability can simplify complicated situations. This is a high-energy time and is especially positive for finding a new job or better securing your current position. You can win recognition for detailed craftsmanship or practical solutions. This time is excellent for upgrading any tools or technology you use every day. Don't cut corners. You'll be most successful insisting on quality work and high standards of public service.",
      "wellness": "  The cosmos is guaranteed to get everyone worked up. Stay calm and don't let anything or anyone upset your digestive system. If you can keep yourself together, the days ahead should be much easier and more restful. Relationships might be tense, but getting intimate could help you see the reality of any issues and bond more closely with your mate.",
      "money": "  You have some disharmonious aspects this week, which could bring some tension into your life. Although there's some weightiness to your career sector, don't neglect your relationships. You have a wonderful bunch of people who can give you advice on things from job searches to investments. Use them to your best advantage.",
      "matches": [
        6,
        11,
        3
      ],
      "ratings": [
        4,
        4,
        4,
        4
      ]
    },
    "month": {
      "text": " Reach for the stars, Scorpio. Powerhouse Mars continues to propel you into the limelight as it blazes a trail in your solar tenth house of achievement. You could be tackling major projects and initiatives in July, as well as seeing awards, recognition, and promotions for previous hard work. If you aren’t happy with your current place in your industry, use this time to change direction.Also, at the start of the month, the sun is in fellow water sign Cancer and your solar ninth house of expansion. The new moon on  9 could open a doorway for you to soar in a new direction, opening your mind to endless new possibilities. Academic initiatives, media projects, immigration plans, or traveling pursuits could all become important at this time. Use this period to take action in these areas.Venus moves into your solar eleventh house of friendship beginning on the twenty-first, ensuring that you could attend some dazzling events and have quite a bit of fun in the weeks ahead. Mars joins Venus here on  29, guaranteeing a lively period too.Another point to watch this month is a full moon in your solar fourth house of domesticity on the twenty-third. This lunation is the first of two back-to-back full moons in Aquarius, which could bring a culmination to a home or family situation. As the planets clash at this time, though, disheartening news may appear. No matter what happens, step up and handle it.Standout days: 9, 12, 13Challenging days: 1, 8, 23",
      "matches": [
        6,
        11,
        3
      ],
      "ratings": [
        4,
        4,
        4,
        4
      ],
      "money": []
    },
    "year": {
      "text": "\nThis is an extremely important year for your powerful sign of the Scorpion. Several transits tug and pull at major points in your personal chart, bringing you brand-new perspectives, and also requiring you to implement decisions that contribute to both, your family and career life.\n\nThis combines several areas of your personal affairs and asks you to really look into your long-term arrangements from the perspective of a leader, caretaker, and healer. As 2021 brings along with it an influential square between Saturn in Aquarius and Uranus in your opposing sign of Taurus, this creates a prominent T-square in your own chart. This can be a difficult astrological energy most pointedly experienced during mid-February, mid-June, and the end of December, but leads to radical change in your overall life. There can be many unplanned events that ultimately decide your fate and affect your home and career situations. You might even consider moving for work, or relocating in some capacity.\n\nPluto, your home planet, enters a retrograde cycle through Capricorn between June 28 and October 7, making this timeframe a key zone to revisit what still needs to be accomplished in order to feel fully empowered and take back your personal authority in certain areas where you felt you lost your confidence. Some see you from the outside that have no idea what's been bubbling under the surface. Don’t lose sight of the big picture, and always remember that the universe wants you to succeed at anything you set your mind to, and this year is no exception to that rule.\n",
      "matches": [],
      "ratings": [],
      "money": [],
      "love": [],
      "career": [],
      "wellness": []
    }
  },
  {
    "today": {
      "text": " More pleasant conditions that are a lot easier to deal with could lull you into a new sense of security in your relationships. Personal and professional interactions should be especially warm and supportive. This should last for a while, Sagittarius, but then the situation will probably revert to whatever it was before. Make the most of the situation while it lasts. Don't expect it to be permanent.",
      "matches": [
        5,
        1,
        2
      ],
      "ratings": [
        3,
        4,
        4,
        2
      ],
      "money": []
    },
    "yesterday": {
      "text": " Romance may be very much on your mind today, Sagittarius, though not necessarily in a positive way. Doubts and insecurities could take over your thoughts. Does a current or potential romantic partner share your feelings? Direct communication with the one in question could be premature, so it might be best to try to remain objective and judge the situation accordingly. Meanwhile, take it day by day.",
      "matches": [
        7,
        12,
        4
      ],
      "ratings": [
        4,
        4,
        4,
        4
      ],
      "money": []
    },
    "tomorrow": {
      "text": " If you spend the day at home, Sagittarius, the walls may seem to close in around you. Squabbles over nothing could erupt between you and other household members, and a lack of energy could plague you. This is a good day to get some exercise. Take a walk, ride a bike, or take a cardio class. This should work off your frustrations while creating more physical energy.",
      "matches": [
        6,
        1,
        3
      ],
      "ratings": [
        3,
        4,
        2,
        3
      ],
      "money": []
    },
    "week": {
      "text": "  Make the first move when it comes to family matters as Mercury in Cancer trines Jupiter in Pisces on Monday. Your words have the power to transform your family relationships, whether you’re asking for money, or trying to create harmony in the home. Express your intimate feelings to gain understanding.However, you might have to deal with some family drama when Pallas retrogrades in Pisces and your home zone on Wednesday. You might face some emotional wounds from childhood that you’ve been ignoring. Find emotional security if you’re feeling overwhelmed, Sagittarius. You’ll need a support system.Try finding that security and an outlet in art therapy when Chiron retrogrades in Aries and your pleasure zone on Thursday. It might be beneficial for you to find a creative way to express your emotions. Find the joy in entertainment so you can find relaxation. ",
      "love": "  Is it time to look for love in faraway places? Exotic locations call to you during the Mercury-Jupiter trine at the start of the week, and starting a long-distance relationship sounds really appealing for a lot of different reasons right now.Wise asteroid Pallas goes retrograde while in psychic Pisces in the middle of the week, giving you a sense of the right—and wrong—path. Not being able to make up your mind is a major stumbling block now, Sagittarius, because you could miss out on an important opportunity while you overthink things.There’s a sun-Pluto opposition over the weekend that could bring out personality traits that you’d rather not display. If you’re getting to know someone new, playing Truth or Dare isn’t the best idea right now. If you must play, always choose Dare.",
      "career": "  Expect to be busy now. Legal matters and stubborn employee\/employer issues can be stressful. Do your best to stay out of interoffice conflicts. If you've been sitting on intense feelings, there can be a personal or even public meltdown. Do your best to keep things simple. Talk about what's happening with someone you trust. It's especially important not to be thin-skinned in the face of criticism or disappointment on the job.",
      "wellness": "  You could have a minor accident if you rush. The aspects are nothing to worry about, but they could increase a sense of panic and agitation. Things should be more restful in a few days. For your overall peace of mind, keep relaxing deeply for a minute or two during the day. Get in the right mood to face any challenge.",
      "money": "  This week is about the astrological activity in your house of debt. You might receive a bill, phone call, or reminder about an outstanding invoice. Don't ignore it. You may be in for an unpleasant surprise if you do. It could get worse, meaning added penalties. The person you owe money to may adopt a sudden and possibly unpleasant collection method.",
      "matches": [
        5,
        1,
        2
      ],
      "ratings": [
        3,
        4,
        4,
        2
      ]
    },
    "month": {
      "text": " At the start of July, you’re feeling the urge to merge, Sagittarius. This is due to the sun causing your intimate desires to sizzle!The new moon on  9 could open a doorway for you to assess the balance in your personal and business relationships. This same lunation is auspicious for applying for a loan or scholarship or negotiating extra benefits with your employer. News of a settlement or payout could also be coming your way.â\u009c¨Mark down the best dates for your zodiac sign with your Sagittarius Monthly Horoscope! â\u009c¨Fiery Mars blazes a trail through fellow fire sign Leo all month, bringing you more energy to move toward your personal and professional goals. You could also be especially busy with an academic, media, or international matter.Sweet Venus begins to grace your solar tenth house of professional success on the twenty-first, beginning a long trend of planets moving through this sector. Get ready to be in the spotlight for quite some time.The full moon on  23 falls in your solar third house of communication and could bring a culmination to a writing, speaking, advertising, or social media endeavor.This is the first of two back-to-back full moons spotlighting Aquarius. Of the two, though, the first one could be a bit more problematic and throw some obstacles in the way of your plans. Be flexible but proactive. This will aid your movement forward while also preparing for the hiccups that are bound to occur. You have what it takes to make  a milestone month in your 2021 storybook, Sagittarius.Standout days: 13, 24, 29Challenging days: 6, 9, 23",
      "matches": [
        5,
        1,
        2
      ],
      "ratings": [
        3,
        4,
        4,
        2
      ],
      "money": []
    },
    "year": {
      "text": "\nWhat an absolute turning point kind of year 2021 will be for you, Sagittarius! There is a miraculous energy all around you that is quite refreshing for your benevolent sign of the Centaur. You will have times of massive self-reflection that can trigger old wounds, also met by extremely gracious moments of friendship!\n\nThe presence of the lunar and solar eclipses cycle through both, your personal sign and opposing realm of the Twins. This helps you get a full perspective and observe the world through a brand-new scope. You have various mass realizations this year that will set you on a successful course.\n\nThe May 26 total lunar eclipse in your sign, for example, provides a massive release in your personal life that is both purifying and strengthening. This can be an energetic blockage you've had for years that lifts and releases from your life. You may feel more exposed than normal, but that is the point of these shifts.\n\nLater on, as an illuminating annular solar eclipse in Gemini galvanizes your personal seventh house of partnerships on June 10, there is no place to hide! You are out and proud of whatever you believe in!\n\nThe goal this year is to get you expressing from a more heartfelt space. Appreciating life, and living it up is what it's all about these days. Even with the hardships of the world, your Jupiterian sign can really feel the love even through the tougher of times. The year concludes with a total solar eclipse in your sign on December 4, igniting your passions and bringing fruitful messages from the cosmic forces that be!\n",
      "matches": [],
      "ratings": [],
      "money": [],
      "love": [],
      "career": [],
      "wellness": []
    }
  },
  {
    "today": {
      "text": " Your sharp intuition and imagination could bring enlightening spiritual insights, Capricorn. Metaphysical or religious books could be especially appealing. Relations with close friends and family should benefit from this enhanced sensitivity. You may be able to understand them better because of it. This could be inspiring. It might move you to write or start some other creative activity.",
      "matches": [
        7,
        2,
        4
      ],
      "ratings": [
        3,
        4,
        2,
        3
      ],
      "money": []
    },
    "yesterday": {
      "text": " Brusque words or a lack of cordiality from a friend or colleague might have you wondering if this person is angry with you, Capricorn. Don't let your insecurity make you crazy. This person probably just has problems of their own on their mind. Do your best not to take any stinging comments seriously. Have a little faith and show a little compassion.",
      "matches": [
        6,
        2,
        3
      ],
      "ratings": [
        3,
        4,
        4,
        2
      ],
      "money": []
    },
    "tomorrow": {
      "text": " Today you might be waiting for a letter or call from a close friend or love partner, Capricorn. Its delay could cause a powerful feeling of gloom. Don't let it spoil your day. The communication will come, and if not today, then within a few days. Meanwhile, this is a great time to try your hand at writing or music. Be creative while you wait. You might also call another friend.",
      "matches": [
        7,
        1,
        5
      ],
      "ratings": [
        2,
        2,
        2,
        2
      ],
      "money": []
    },
    "week": {
      "text": "  Communication issues kick off your week when Pallas retrogrades in Pisces and your communication zone on Wednesday. The asteroid could make it difficult for you to get your point across or express your emotions. Stress can feel overwhelming, especially when you can’t turn off your brain. Ask friends for help coping with this stress.Focus on healing your inner child when Chiron retrogrades in Aries and your family zone on Thursday. You might need to have difficult conversations with family members as you heal. Look for emotional security and a foundation to keep you steady.Your week ends on a rocky note when the sun in Cancer opposes Pluto in your sign on Saturday, bringing some relationship drama. A domineering partner could make you feel trapped. However, before things go south, have a serious conversation with your partner about your feelings to reach a better understanding. ",
      "love": "  There are a lot of emotions swirling around during the water sign trine between communicative Mercury and lucky Jupiter at the beginning of the week, and you’re here for all of them. Don’t fight it, Capricorn. Let someone get past that serious exterior for a change.There’s also a sun-Neptune water sign trine in the middle of the week that can improve your outlook on a romantic situation. What’s stopping you from going all in? Yes, you’ve been hurt before, but your intuition can lead you along a better path now. Follow your heart.Asteroid Chiron is traveling with powerful Aries as it goes retrograde around the same time, giving you the courage to finally step up and take charge of your own romantic past. Don’t hesitate to set the record straight now, especially if it will lead to emotional healing.",
      "career": "  Now it's important to build a good foundation for the future. Careful planning in any area supports your work later. This is a positive time for architectural, drafting, or sculptural interests. You may have a sense that you can be at the right place at the right time. Events bring out your management talent. You may also be a passionate defender of law and order. These are great days for training on the job.",
      "wellness": "  Arguments or emotional confrontations could make you feel unwell. There is a lot of stress around now. If you can stay calm rather than overreact, it will help you feel better. Delegate some tasks and give yourself a bit of time off. You'll feel a sense of release that enables you to return to your usual vibrant self.",
      "money": "  You have activity in your house of money and values. It could mean extreme good fortune that's unstable or short-lived. If you're the gambling type, it isn't a bad week to give the wheel a whirl, but put at least half of every win in your pocket - and don't touch it. Since your house of relationships is affected, you may irritate someone if you aren't careful.",
      "matches": [
        7,
        2,
        4
      ],
      "ratings": [
        3,
        4,
        2,
        3
      ]
    },
    "month": {
      "text": " At the start of July, the planets are speaking about partnership and intimacy for you, Capricorn.Fiery Mars is igniting your sensual side and sexual desires throughout the entire month, encouraging you to grow especially close to someone special. If there are any relationship traumas or fears bubbling beneath the surface, you can work through them now so that you don’t have to hold onto vulnerability or trust issues.This same energy could also be increasing your expenses, because the solar eighth house holds ties to large sums of money in the form of debts or loans.The sun and Mercury spend most of the month smiling at you from across the sky.The sweet new moon on the ninth, spinning in her dazzling white dress, reaches out her hand to you, encouraging you to make promises and commitments to your significant partner in love or business. Some coupled Capricorns may make long-term plans together, move in, get engaged, or even marry. Single Capricorns can also utilize this energy to put themselves out there and set up meetings with prospective suitors who seem to have serious potential.Later in the month, a full moon in Aquarius and your solar second house of finances appears on  23. This lunation could bring a shift around money matters, perhaps a large expense, the end of a job, or perhaps a raise. This is the first in two back-to-back full moons in this arena, so while this first one could bring more heavy news than you’d like, the rest of the year looks more favorable for your financial life.Standout days: 5, 15, 20Challenging days: 1, 8, 17",
      "matches": [
        7,
        2,
        4
      ],
      "ratings": [
        3,
        4,
        2,
        3
      ],
      "money": []
    },
    "year": {
      "text": "\nYou have woken up to a different version of yourself this year, Capricorn! You are a unique soul that is here for a welcoming purpose on this earth! The presence of your home planet Saturn through the sign of Aquarius is in full force this year, and has many lessons for your sign of the Goat to take in and process.\n\nThere is some element of psychology pulling at you, which requires you to be wise beyond your years. You are experiencing a new world for yourself, and might even long for things to go back to the way they were. But the innovative influence of Aquarius will have you feeling more emotionally detached from your partnerships and friendships, pulling you into the future!\n\nAs a sign who often puts work over love, this can be a little easier for those Goats who just want some energy to jump into their professional life with zero constraints. For those who are ignoring your relationship duties because work gets in the way, this is a year where you can truly come face-to-face in this respect, and be open about your feelings.\n\nThere is some pattern that needs to be reassessed in your overall life. The difficult square between Saturn in Aquarius and Uranus in Taurus takes you away from the original structure you once perceived to be the rules, and now asks you to be a little more radical and step out of your own way. The turning points this year are not limited to mid-February, mid-June, and late December, but do bring on these squares in strong. This is a lesson that will test your self-esteem, but that is meant to cleanse your second chakra of creativity.\n",
      "matches": [],
      "ratings": [],
      "money": [],
      "love": [],
      "career": [],
      "wellness": []
    }
  },
  {
    "today": {
      "text": " Some intense dreams about someone you haven't seen for a long time could have you wondering what this person is doing now, Aquarius. It might also awaken the desire to be in contact again. Call if you can. You might be pleasantly surprised. An increased psychic sensitivity could cause you to better understand the thoughts and feelings of family members. Communication of all kinds should go well today.",
      "matches": [
        8,
        2,
        6
      ],
      "ratings": [
        2,
        2,
        2,
        2
      ],
      "money": []
    },
    "yesterday": {
      "text": " Someone could call and want to share some troubles with you, Aquarius. Your sensitivity and compassion may attract more than one unhappy person in need of sympathy and advice. While this is flattering, it could be a bit of a drag as well. You aren't likely to turn these people away. Accept this as a natural consequence of being a good listener. And take care not to let these sad stories get to you.",
      "matches": [
        8,
        3,
        5
      ],
      "ratings": [
        3,
        4,
        2,
        3
      ],
      "money": []
    },
    "tomorrow": {
      "text": " Whatever skills or talents you're using to accomplish your present goals may seem blocked, Aquarius. This could give rise to a sense of frustration if you let it, but don't fall into this trap. If you can't get motivated, focus on something else, perhaps an activity you've never tried before. This could get your mind going again while allowing your other skills to pick up steam.",
      "matches": [
        9,
        2,
        6
      ],
      "ratings": [
        4,
        2,
        3,
        4
      ],
      "money": []
    },
    "week": {
      "text": "  The week brings potential money issues when Pallas retrogrades in Pisces and your value zone on Wednesday. You may struggle with how you spend and save your money—or even become obsessed with it. You might also struggle with self-esteem during this retrograde, so try to remember your worth, especially when money is tight.Communication becomes extra important when Chiron retrogrades in Aries on Thursday. Writing and taking a short trip can help you get in touch with your emotions so you can express them better. Talk to siblings, friends, and neighbors to form stronger connections.Spend Saturday relaxing when the sun in Cancer opposes Pluto in Capricorn, creating an ideal time for some self-care and self-improvement. Work on healthier habits and take care of your body and mind even if you don’t feel like it. Your health will thank you later. ",
      "love": "  Set the wheels in motion for a great romantic adventure during the Mercury-Jupiter trine at the start of the week. Even if you can’t manage to go somewhere now, you need something to look forward to! The more exotic the location, the better chance you have at finding love.The awkward pairing of Pallas in emotional Pisces isn’t made much better when the asteroid goes retrograde in the middle of the week, especially because it makes you think about all the pain you’ve endured in the past. Luckily, facing reality now can be a healing experience.Your naughty side comes out during the sun-Pluto opposition over the weekend, and it might point you in the direction of people who aren’t the best for you. You’ve been in unhealthy relationships before, but purposely hooking up with someone you know will have a bad influence on you is a no-no now. ",
      "career": "  You'll be especially aware of other people's needs and desires. This can help you as a manager or in seeking to do your best on the job. Events can bring recognition and personal satisfaction if you find more effective ways to meet basic needs. Something as simple as bringing in home-cooked food to share can improve everyone's mood. Networking with people you may not know well can help you discover a new or better position.",
      "wellness": "  Take it easy if stressful influences lead to minor accidents at home. You and your partner could be at loggerheads. Things will calm down and be more relaxing later. Use this opportunity to pamper yourself and feel good about life again. Good, old-fashioned home comforts will bring you down to earth, but try not to overdose on comfort foods!",
      "money": "  You have lots of astrological activity surrounding your money life this week. Aspects in your house of relationships mend fences between your male and female energies. Pay more attention to what you're spending at home. It may be more than you think.",
      "matches": [
        8,
        2,
        6
      ],
      "ratings": [
        2,
        2,
        2,
        2
      ]
    },
    "month": {
      "text": " With fiery Mars charging like a racehorse across the sky from you, Aquarius, partnerships are a top priority for you. This is because the red planet is igniting your solar seventh house of relationships, encouraging you to work as a team with someone important rather than fly solo. Committed Aquarians can make long-term plans together and make a tremendous amount of progress.Single Aquarians can also harness this energy by putting themselves out there to find someone special who wants to stay by their side. If you’re looking for the perfect collaborator, assistant, trainer, or other business associate, you can use this time productively.Next to note is the movement of the sun and Mercury in your solar sixth house of productivity. Your mind is especially focused on finding the right work\/life balance, as well as assessing your routine.The new moon on  9 could bring more responsibilities and projects from your employer or even the possibility of a new job. This is also an auspicious time to improve your fitness and diet regimen.However, a major turning point arrives when the full moon in your zodiac sign appears on the twenty-third. This is the first of two back-to-back full moons in Aquarius, showing that you’re in the spotlight once again. However, this first one could bring conflict, opposition, and challenges your way as you seek to assert yourself. Do your best to not lean into stubbornness. Be flexible or the universe could strike you down.Luckily, benevolent Jupiter swoops in like a guardian angel, returning to your zodiac sign on  28, where it remains for the next six months to help you.Standout days: 13, 22, 23Challenging days: 1, 6, 8",
      "matches": [
        8,
        2,
        6
      ],
      "ratings": [
        2,
        2,
        2,
        2
      ],
      "money": []
    },
    "year": {
      "text": "\n2021 is the year to be an Aquarius! It is all about your ever-evolving sign that presents a unique and accepting perspective to the world at large. You are here to really provide inspiration to the planet as everyone around you seems to be super confused about where to turn next.\n\nYour Water-bearing sign is ready to embrace and fully appreciate the amazing vibration gifts the universe has in store! It is truly a time to ask your spirit guides for what you want, and find a surprise waiting for you around every corner!\n\nAs Saturn briefly entered your sign in 2020 experiencing a six-month retrograde cycle, you've gotten an idea of where you are headed this year. The structured planet is now transiting through your eccentric sign that enjoys the unknown twists and turns that bring forward many surprises and adventures.\n\nThe year is marked by some intense squares between Saturn in your sign and Uranus in the fellow fixed sign of Taurus. Because you are co-ruled by both of these two outer-bodies, this is going to be an exponential lesson for you.\n\nThere is a strong connection to time itself these days. You might feel throughout the year that time is either moving extremely fast or slowed down to a glacial pace. The most pointed squares being present on February 14, June 14, and December 24 will really test your sense of time in general. The entire purpose of this energy is to align you with your spiritual awareness and allow you to make decisions from your sense of intuitive awareness.\n",
      "matches": [],
      "ratings": [],
      "money": [],
      "love": [],
      "career": [],
      "wellness": []
    }
  },
  {
    "today": {
      "text": " Social events or group activities concerned primarily with spiritual, metaphysical, social, or humanitarian issues could take place in your community today, Pisces. These could be enlightening and enjoyable, and you could make some new friends. The exchange of ideas could get your mind going a thousand miles an hour. Get a little exercise to clear your head or you might have trouble sleeping tonight.",
      "matches": [
        10,
        3,
        7
      ],
      "ratings": [
        4,
        2,
        3,
        4
      ],
      "money": []
    },
    "yesterday": {
      "text": " Uncertainty about money could plague you today, Pisces. You might have doubts about income now, particularly if you're self-employed. Be careful not to make yourself crazy. Your insecurity might cause the situation to seem even more serious than it really is. Try to be objective. If there are genuine concerns - and there may not be - find a way to alleviate them rather than waste energy worrying.",
      "matches": [
        9,
        3,
        7
      ],
      "ratings": [
        2,
        2,
        2,
        2
      ],
      "money": []
    },
    "tomorrow": {
      "text": " You might feel creative, artistic, and full of ideas for new projects. However, Pisces, other responsibilities could keep you from starting on them. At the same time, your mind could be so focused on them that your other work takes longer than it should. Write down your ideas before they escape, then concentrate on the tasks at hand. Finish those and then you can pursue what you really want.",
      "matches": [
        10,
        4,
        7
      ],
      "ratings": [
        4,
        4,
        3,
        3
      ],
      "money": []
    },
    "week": {
      "text": "  Start the week by doing things that make you happy, Pisces. On Monday, Mercury in Cancer trines Jupiter in your sign, making it an excellent day to practice self-expression and do things that bring you pleasure. Focusing on having fun will bring you good luck and great vibes.And you’re going to need those good vibes when Pallas retrogrades in your sign on Wednesday. This could be an overwhelming time with many emotional changes. You’ll need to be extra self-aware because your outward behavior may change to deal with your internal frustration. Be kind and take care of yourself.Work on your self-esteem when Chiron retrogrades in Aries on Thursday. Remind yourself you have value despite how you may feel. Take time to invest in yourself and boost your confidence. It might be tempting to engage in retail therapy during this time, but that isn’t a lasting solution. ",
      "love": "  Mercury is in fellow water sign Cancer when it trines adventurous Jupiter in your creative sign in the beginning of the week, which means good times are accompanied by a lot of feelings. Is it possible to just hang out with your crush and have fun without reading more into it? Probably not!The sun forms a trine to Neptune, also in your sign, in the middle of the week, which gives off a lot of the same energy as the sun-Jupiter trine above. However, your intuition is spot-on now, giving you the advantage in romantic situations. Lucky you, Pisces.There’s a sun-Pluto opposition over the weekend that can lead to questionable behavior if you overthink things. You tend to get so far inside your own head during this aspect that looking at things from a different perspective is virtually impossible. Do yourself a favor and text your BFF for their advice before you do anything you’ll regret later.",
      "career": "  This is an important time in which you should do your best to finish any outstanding commitment on the job. Take time to get your work area better organized. If you've been frustrated by the pace of things, this time may finally bring a welcome breakthrough. Your patience and persistence will finally begin to show results. This is a powerful time to prepare to find or apply for a new job.",
      "wellness": "  Arguments on the home front could bring a powerful current of tension. One issue could cause sparks. If you feel on edge, it could contribute to tension headaches or sore muscles. This is the last thing you need when you're busy. The pressure diminishes as the week progresses. The more you can relax your mind and thoughts, the better you'll feel.",
      "money": "  This week is about the clash of energies in the sky as several planets fight for your attention. Some will help you get settled into your work and develop a plan for advancement. But you've also got a conundrum on your hands. Should you go along with the status quo or fight for individuality? The former is better for now.",
      "matches": [
        10,
        3,
        7
      ],
      "ratings": [
        4,
        2,
        3,
        4
      ]
    },
    "month": {
      "text": " With powerhouse Mars igniting your solar sixth house of productivity, Pisces, you are especially busy this month. You may be hard at work with your employer, hustling on important projects, or even chasing down important fitness goals. Don’t let yourself burn out, though, because the fire of Mars could see you burning the candle at both ends.The new moon on  9 falls in your solar fifth house of love and recreation, so it’s time to make your heart’s desires a priority. This new moon could open the doorway for single Pisces to find true love or at least line up prospective suitors. Committed Pisces should utilize this period to set up time for romance, because you could reignite the spark in your union or even have luck in fertility. If you’re a creative, this is the most auspicious new moon of the year to immerse yourself in new inspiration.Magical Venus turns a corner to dance across from you in the sky beginning on the twenty-first, setting up a trend of several months with planets in your solar seventh house of partnership. Commitments and engagements could be right around the corner!Next to note is the full moon in your solar twelfth house of rest on  23, which could see you very tired and in need of solitude. Lie low and don’t rock the boat, because this full moon could make your anxiety spike.One last thing to say about  is that it is the final month in 2021 with your co-ruler Jupiter dancing in your zodiac sign. Plant some seeds, take chances, and attract luck to you everywhere you go.Standout days: 5, 12, 15Challenging days: 6, 17, 23",
      "matches": [
        10,
        3,
        7
      ],
      "ratings": [
        4,
        2,
        3,
        4
      ],
      "money": []
    },
    "year": {
      "text": "\nThere's a difficult energy to pin down this year, Pisces. You have to really take the approach of allowing life to come as it is for your sensitive sign of the Fish.\n\nThe most pivotal transit affecting your chart includes a series of eclipses between Gemini and Sagittarius that activate your personal tenth and fourth houses. These are more specifically your zones of career pursuits and family development. Whenever you feel like you are getting out-of-control this year, one strategy to take that will really help you is to always follow your grounded path.\n\nAs Uranus continues to break boundaries in Taurus, this outer planet is also met with a conflicting square with Saturn in Aquarius. This holds the element of extremes, especially in mid-February, mid-June, and late December; but sparks certain events that also affect your loving sign throughout the entirety of the year.\n\nYes, this energy will challenge you on many levels, especially through your personal realms of communication and psychic development. For those Pisces who are open to their gifts, this will be extremely easy for you, and for those who have suppressed your personal intuitive nature, this can feel a little overwhelming at times.\n\nYou are extremely in tune with the unseen world this year, and it can feel like you're able to predict things before they even happen! It is a good year to work with others that support you, and also share your gifts as well. During this fascinating year, your spiritual life might even deepen.\n",
      "matches": [],
      "ratings": [],
      "money": [],
      "love": [],
      "career": [],
      "wellness": []
    }
  }
]